[
  {
    "title": "People who do gender wars are toddlers and it’s irritating",
    "content": "i genuinely don’t get people who build their entire personality around hating the opposite gender. if you really think men/women are trash, then stop dating them, stop sleeping with them, stop having kids with them. you can’t spend all day crying about how awful the other gender is while still chasing them for attention.\n\nthe truth is, both men and women need each other, and pretending otherwise is delusional. calling someone a “pick me” just because they show empathy or common sense about the opposite gender is weak. it’s like people want to stay bitter instead of admitting we literally wouldn’t survive without each other.\n\nmost of these so-called “gender war” people don’t actually want change, they just want to be loud, miserable, and blame the other half of humanity for everything wrong in their life.",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1mtr2ad/people_who_do_gender_wars_are_toddlers_and_its/",
    "score": 44,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1mtr2ad",
    "bertscore_f1": 0.5333505272865295,
    "bertscore_precision": 0.5417893528938293,
    "bertscore_recall": 0.5251705050468445,
    "top_level_comments": [
      {
        "score": 9,
        "body": "Please, don't insult toddlers.",
        "author": "TransmissionsSigned",
        "author_hot_comments": [
          {
            "score": 1,
            "body": ">Si sabes que congelar el tiempo implica afectar el espacio verdad? Ya que detener el tiempo implica afectar el espacio + tiempo ya que estás dos van de la mano y esto está por encima de las matemáticas convencionales de Gojo.\n\nDon't try to adapt real world physics to this, it makes no sense. If infinity divides the space such that Esdeath can never touch Gojo, it doesn't matter that time is stopped, because Esdeath keeps moving through space.\n\n>Aprende sobre dimensionalidad o incluso algo de física, \n\nIronic."
          },
          {
            "score": 1,
            "body": ">So, why should men keep giving attention when they receive none?\n\nThis? But:\n\n>Interestingly enough, what men do always catches their attention. They want to know what men are up to, even if men are \"ill intentioned as a majority\"\n\nWhich is what you're doing. You care that they care, aka, attention.\n\n\"But I didn't say they are ill intentioned as a majority!\". Exhibit A:\n\n>*As long as men give them attention, men are a tool for self esteem*\n\nStill, I don't care enough about the humor in the situation to argue. Cheerio."
          },
          {
            "score": 1,
            "body": "From Yamcha to Grand Priest, depends on the Superman version."
          },
          {
            "score": 1,
            "body": "Gojo."
          },
          {
            "score": 1,
            "body": "https://preview.redd.it/mnrinpjpz9kf1.png?width=1080&format=png&auto=webp&s=95e4e9981e60fc816fe500b0054b9ad198fe4467\n\nThere."
          },
          {
            "score": 1,
            "body": "That this post is about you caring about what women do, while generalising them in a way which implies you probably don't like them very much. It's funny, is all, didn't mean to offend."
          },
          {
            "score": 1,
            "body": "Unsurprising. "
          },
          {
            "score": 1,
            "body": "I just get bored and start something else. I've never felt guilty about it. Just today I dropped Ender in Exile, and I couldn't be happier."
          },
          {
            "score": 1,
            "body": "I was 7. I had a friend who said he was smarter than me. To prove it, he read Matilda, by Roald Dahl. \n\n\nI was confident he was wrong. To prove it, I read David Copperfield, by Charles Dickens.\n\n\nIt all fell into place from then."
          },
          {
            "score": 1,
            "body": ">So how, then, can you really tell whether or not someone else is confident in themselves without being obnoxious, yourself?\n\nIt's not what you *are*, it's what you *come off as*. There are some behaviours that read as obnoxious even if that's not the intention. For example, I know a guy that knows when he's right, he's confident about it. No one likes him because it's always his priority to show how he's right and you're not. It's obnoxious.\n\n>if - for example - if someone doesn't like me then they get to say I'm \"not there\" yet.\n\nIf someone doesn't like you, you could be Henry Cavill himself, it wouldn't matter. Being confident only helps *before* you know someone in my experience. I know where you're going with this, but I don't think it applies. Most people probably don't dislike you because you're ugly. If that were the case, most ugly people would be alone and they are not. Such a social bias exists, and I can't know the extent of it, but many of the people I consider ugly live full social lives.\n\nWhen I was younger, I thought everyone hated me when they actually didn't. I was sure that people disliked me upon laying eyes on me and that I had 'something' fundamentally unlikable. Is it possible you're going through something similar?\n\n>what makes someone appealing isn't actually this notion of \"confidence\" but rather something else.\n\nYes, of course. It's not that confidence makes you appealing, it's that the lack of it makes you unappealing. For example, I'm fairly good looking, but since I had the confidence of a wet sock, when I was approached it didn't tend to last long UNLESS I was comfortable for whatever reason, which made me more confident.\n\nYou are not going to become desirable just because you're confident, but it helps to show people *you*. When people who love you tell you to be confident, they probably think you are worth showing. When people on Reddit say it, they are being parrots.\n\n>In the end it is all subjective; one thing that true confidence *shouldn't* be doing is making you think you know everything, because you really don't.\n\nTrue confidence is just not giving a crap, I think. That's why it's so hard to get or fake, because if you care about being confident, you aren't. When you care, you crave validatio and that becomes obnoxious, which is commonly lumped in with 'overconfidence'.\n\nSome people have other positive qualities that allow them to be obnoxious and still find success. They are not being rewarded for being obnoxious, but in spite of it. Their other qualities just cancel it out. Looks are a common example because you don't have to work through a person's personality to see them, unlike humor, kindness, etc; which take longer."
          }
        ]
      },
      {
        "score": 7,
        "body": "Ironic username, OP, lol.",
        "author": "Makuta_Servaela",
        "author_hot_comments": [
          {
            "score": 1,
            "body": ">  if we asked our mothers, most of them would not say they were unhappy in their marriages.\n\nI used to work at a group home for elderly people... Elderly women have skeletons in the closet, let me tell ya.\n\n> they were legitimately happy when they found this man. \n\nWomen weren't allowed to own property in many places. Being able to have a house and food would certainly make someone a bit less unhappy, yeah. My, and your mother lived in a time where women couldn't own credit cards.\n\n> We even see this with single moms with young children, they will prioritize finding men who can provide. \n\nThey wouldn't have to if we stopped doing everything in our power to prevent them from getting community help. I bet you that if public-funded daycare and school, birth through community college, was widely accessible, we'd have way less single moms desperate to find a provider man.\n\nI pay my taxes. I want my taxes to go toward making sure no woman or child is forced into an unhealthy relationship at the risk of homelessness if they leave the man.\n\n> Though again we often see them switch back to short term mating once the children get to the age where they are self sufficient.\n\nProves my point. No other high-sapience high-social mammal species with childhoods as long as we have are nuclear family raisers. The most common childrearing strategy for high-sapience, high-social mammals is communal raising, with mom getting final say, and other adults helping out. That's what humans should do as well."
          },
          {
            "score": 1,
            "body": "The only real trend I'd consider a concern, other than like illegal stuff, is spending too much time on any social media platform.\n\nOtherwise, the differences I've noticed on different platforms is:\n\nReddit: I do not know a single friend's Reddit account. I feel like Reddit is the kind of site that you don't really share your account. Most of my friends know mine, though, since I run a sex-ed-for-adults webcomic on Reddit.\n\nTwitter: Someone who wants general news.\n\nDiscord: Wide range, but very likely to be someone with low social skills. If this person vents to me about problems they are facing, 9 times out of 10 it's problems that person is at least 90% responsible for causing. Also, if a male, likely addicted to porn, and if a female, likely terrible self-body image, (possibly due to the aforementioned men's porn addiction thing). I'm a bit biased here, though, since my main Discord interaction is via the Discord server *for* my sex-ed webcomic.\n\nBlueSky: This person is a furry.\n\nInsta: Never been on Insta so idk. \n\nFacebook: This person is not tech savvy and/or is over age 50. (I'm not on Facebook, but I know people who are).\n\nThreads: The hell is Threads?\n\nTikTok: Never been on TikTok"
          },
          {
            "score": 14,
            "body": "The decision-making part of his brain is the damaged part. Why they even considered him capable of making decisions is beyond me."
          },
          {
            "score": 12,
            "body": "> and without explanation,\n\nHis frontal lobe (the decision making part of the brain) was the damaged portion. That's pretty obviously the explanation."
          },
          {
            "score": 12,
            "body": "My GSD would have fallen as many times as that dachshund did."
          },
          {
            "score": 416,
            "body": "Red dress also has thicker heels, versus the other's thin stiletto or near-stiletto heels. Easier to walk in."
          },
          {
            "score": 1,
            "body": "Oh, I wish you had told me earlier you were joking, so I wouldn't have wasted my time. Sorry, I thought you were having an honest conversation.\n\nI appreciate that context. I'll mute this, then, so I can focus on actual debate."
          },
          {
            "score": 3,
            "body": "Eitra: \"You won’t lose your tightness from tampons. Nor will you lose your virginity… that wouldn’t even make sense. By definition, “virginity” just means “a penis being put in an orifice”... so even if it was a real thing, tampons can’t affect it, unless you’re calling virginity a hymen, and tampons don’t usually break that either.\"\n\nEmi: \"And that’s, of course, assuming that virginity even means anything in the real world, which it doesn’t.\""
          },
          {
            "score": 3,
            "body": "Eitra: \"You won’t lose your tightness from tampons. Nor will you lose your virginity… that wouldn’t even make sense. By definition, “virginity” just means “a penis being put in an orifice”... so even if it was a real thing, tampons can’t affect it, unless you’re calling virginity a hymen, and tampons don’t usually break that either.\"\n\nEmi: \"And that’s, of course, assuming that virginity even means anything in the real world, which it doesn’t.\""
          },
          {
            "score": 1,
            "body": "> This is just not a fruitful discussion because you're just dishonest.\n\nIronic coming from the person who apparently missed sex-ed.\n\nSex doesn't cause pregnancies. Sperm entering a woman's vagina causes pregnancy. The vast, vast, majority of sex acts do not involve a sperm entering a woman's vagina.\n\n> You don't need to keep being up sex. No one is insisting the man doesn't have the right to or not have sex. \n\nIn my previous comment, I distinguished that as Number 1. Which is separate from Number 2. \n\n\n> The man has absolutely no rights. You can't use word games to get around this. The man has no rights in this choice.\n\nYep. They both decide Number 1. **He** only decides Number 2. **She** only decides Number 3. They have an equal number of decisions."
          }
        ]
      },
      {
        "score": 4,
        "body": "I mean, the way that many people act makes the Jesus quote about motes and beams seem really reasonable",
        "author": "slicehyperfunk",
        "author_hot_comments": []
      },
      {
        "score": 2,
        "body": "I agree. I find it to be sooooo weird that they do that. They don’t realize that engaging in this behavior is perpetuating sexism, and causing unnecessary riffs.\n\nYou care about men, and you’re called a “pick-me”. You care about women, and you’re called a “simp”.\n\nWhile these people are complaining, the pick-me’s and simps are living happily together, and they’re all alone.\n\nCrazy.",
        "author": "bridget14509",
        "author_hot_comments": [
          {
            "score": 4,
            "body": "Jesus? Who the fuck is that?"
          },
          {
            "score": 4,
            "body": "This is true. I’m a gay woman, and I grew up hearing women talking about getting money off guys. \n\nThe moms at the church I grew up in told the girls (including me) to date every guy we could so we wouldn’t have to pay for anything, including meals, even if you don’t like him. It felt gross to me, because I thought I would feel extremely hurt if I was treated like that.\n\nThere are also some toxic women that I’ve come across while dating, and one was bragging to me while drunk about how easily emotionally manipulated men are, and how she takes all their money and uses them for sex. \n\nBeing a shit human being comes from both sides. Men have the capacity to be terrible, and so do women."
          },
          {
            "score": 0,
            "body": "Yeah. I don't think we should be taking Hitler's ideology seriously if he was watching Disney movies obsessively and doing animal rights, all the while casually committing genocide and searching for occult artifacts lmfao\n\nNazi propagandists actually thought Wagner was too pacifist for Nazi ideology lmao\n\nHitler was a confirmed meth head and weirdo"
          },
          {
            "score": -1,
            "body": "Hitler was also cross faded consistently on meth, amphetamines, cocaine, opiates, and barbiturates, and invaded Poland the same year he started taking methamphetamine 😎 \n\nThere’s also a film of him tweaking the fuck out at the 1936 Olympics (which is incredibly dystopian to look at ngl)"
          },
          {
            "score": 0,
            "body": "https://preview.redd.it/amcwleicb8kf1.jpeg?width=1200&format=pjpg&auto=webp&s=efb521b2c59ee6fd44a5d348c674dc5642fec664"
          },
          {
            "score": 49,
            "body": "It’s so weird how lib and center left glaze China. \n\nChina is the country that they’re fighting against becoming lmao"
          },
          {
            "score": 21,
            "body": "I’ve had many leftists deny the Uyghur genocide, saying its western propaganda. And they go on about how amazing China is.\n\nI’m anti-CCP, not because of media, but because I grew up with a Chinese/Taiwanese community, and most of my friends were from China growing up, and all of them hated the CCP. They all loved their culture and people, but hated the government. I feel the same. I share a deep love and respect for the Chinese people, and it’s a shame that they’re being held hostage by an authoritarian regime that only sees statistics and numbers, not lives."
          },
          {
            "score": 12,
            "body": "If Trump made America more like China they definitely wouldn’t lmfao"
          },
          {
            "score": 8,
            "body": "You perfectly understand. Don't pretend to be ignorant."
          },
          {
            "score": 3,
            "body": "🤤 forbidden love 🤤"
          }
        ]
      },
      {
        "score": 3,
        "body": "It’s just people who are jaded or they’re just grifting for views/clout.\n\nYes, most of these people aren’t looking for change, they just want to talk a bunch of smack and feel justified for doing so. Rage baiters.",
        "author": "geardluffy",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "![gif](giphy|uxXNV3Xa7QqME)"
          },
          {
            "score": 12,
            "body": "😂😂😂"
          },
          {
            "score": 7,
            "body": "I wonder if they see you as the coworker who won’t socialize with them and they’re taking it out on you."
          },
          {
            "score": 8,
            "body": "Cashiers are slower and don’t package my groceries the way I like it. Socializing with them can be fun at times but I do get annoyed when they don’t greet me."
          },
          {
            "score": 9,
            "body": "You really think the dude who was begging the cops to take them outta there never once told them to leave?"
          },
          {
            "score": 1,
            "body": "Oof"
          },
          {
            "score": 0,
            "body": "It’s pretty laughable how you think you can gatekeep introversion. People have different levels of social batteries and others are more social introverts. If you had some understanding of this, you’d know that introversion and extroversion is a spectrum, we’re not all the same."
          },
          {
            "score": 1,
            "body": "So if a woman is insecure and depressed because she can’t find love or get any affection from men, would that depression constitute as being sick or suffering greatly?\n\nAnd also, have you ever heard of the hierarchy of needs?"
          },
          {
            "score": 1,
            "body": "I am an introvert. I like it when employees display customer service and the bare minimum, greet me."
          },
          {
            "score": 1,
            "body": "This. I think there are too many disingenuous comments here who say “I got a house, I just saved money” like what? First of all, how much do you make, what price did you buy, how much was the down payment, and what is the interest rate?\n\nSome people can’t save up a lot of money so even if they could put in a minimal down payment, are they going to be able to pay for the mortgage and a lifestyle? \n\nThere are too many variables to simply say yes. OP wants to leave but they’ll need to save up for a long time which probably isn’t what they want to do given the parents."
          }
        ]
      },
      {
        "score": 2,
        "body": "Yes, and it’s not just one sided anymore I see almost as much femcel discourse as incel/red pill nowadays",
        "author": "PiesAndPot",
        "author_hot_comments": [
          {
            "score": 5,
            "body": "Why do we as Americans even accept that we should have to have a license to protect ourself. The right to self defense isn’t just a human right but the logical choice for all living beings. We need to start calling out and providing resistance to those who want us to have our right to self preservation taken away."
          },
          {
            "score": 12,
            "body": "The laws in New York are so crazy. The fact that you can’t carry a commonly owned weapon (handgun) without your special permission slip card is so anti American and anti freedom. It’s sad that our LEO’s enjoy enforcing that law"
          },
          {
            "score": -1,
            "body": "By not actively advocating for taking away my right to prevent my body from being violated by being assaulted or murdered because I can’t protect myself"
          },
          {
            "score": 2,
            "body": "A number of states do not require any form of identification at the polls for most voters. In these states, a voter's identity is typically verified by matching their signature on the poll book with the one on their voter registration record.\n * Examples of States with No ID Requirement: California, Illinois, Maine, Maryland, Massachusetts, Minnesota, Nebraska, Nevada, New Jersey, New Mexico, New York, Oregon, Pennsylvania, Vermont, and the District of Columbia."
          },
          {
            "score": 1,
            "body": "Missing tourniquet, knife, flashlight and a less lethal such as oc or a tazer. Your fake loadout is less effective than what I carry when I got to Walmart"
          },
          {
            "score": 1,
            "body": "I think you can actually? That’s a pretty big point of contention"
          },
          {
            "score": 1,
            "body": "That’s what I did and I got mine no problem"
          },
          {
            "score": 1,
            "body": "I was having trouble finding ppl and I honestly just started calling up old friends from high school and neighbors from my childhood home"
          },
          {
            "score": 1,
            "body": "Honestly. Just hide them really well. Even tear up some interior carpet and hide under if you have to. Get in your car and drive to a free state then transfer them back to ny through the freedom ffl to tyranny ffl back in ny"
          },
          {
            "score": 1,
            "body": "I wouldn’t. When I got mine you are specifically told that family is a no no."
          }
        ]
      },
      {
        "score": 2,
        "body": "That sounds like something a chick might say.",
        "author": "MySillyRedditName123",
        "author_hot_comments": [
          {
            "score": 25,
            "body": "\"Israel is an apartheid state!\"\n\"Can anyone practice their religion in Saudi?\"\n\"About that...\""
          },
          {
            "score": 1,
            "body": "Are you in a Muslim country? Do you feel concerned for your safety because of this choice?"
          },
          {
            "score": 2,
            "body": "My only regret is that I have just one upvote I can give to you."
          },
          {
            "score": -3,
            "body": "Why is this being done? \n\n\nIf a woman chooses to do this, and she's an adult, then leave her alone. It's none of your business. "
          },
          {
            "score": 9,
            "body": "Well, could you stop doing that?"
          },
          {
            "score": 1,
            "body": "Why is that?"
          },
          {
            "score": -1,
            "body": "We Americans can be pretty annoying overall, but don't discount our northern neighbors either.\n\n\nEven before Trump's nonsense, the sense of moral superiority many Canadians had was tiresome."
          },
          {
            "score": 1,
            "body": "KLs trains have expanded exponentially over the last 20 years, but the bus system sucks and the roads are a mess.\n\n\nI have no choice but to own a car, and my wife has one as well. If I didn't have a car, I can't imagine how long it would take me to go to work, even after they finish the station next to my building.\n\n\nGo look at a map of Kuala Lumpur and you'll see the sheer amount of highways the city has, many of which cut through old neighborhoods. \n\n\nKL feels as sprawling as Los Angeles, but with more tall buildings."
          },
          {
            "score": 1,
            "body": "To be fair, Will Wheaton is a dick.\n\n\nI used to follow him on Facebook and he'd be awful to people he disagreed with."
          },
          {
            "score": 6,
            "body": "Well, that was an unfortunate response. Wes was simply pointing out a glaring flaw in the map and if you can't take criticism, then don't post your work publically "
          }
        ]
      },
      {
        "score": 1,
        "body": "[removed]",
        "author": "[deleted]",
        "author_hot_comments": []
      },
      {
        "score": 1,
        "body": "I disagree. Toddlers don’t care about things like gender. ",
        "author": "majesticSkyZombie",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "It’s not ideal to force child support, but the child deserves support. Right now, the only way to do that is to make the man pay."
          },
          {
            "score": 3,
            "body": "Because that’s sexism (and I say that as a woman). I technically agree with you since I don’t like the idea of jails, especially with how they are now, but only sparing one gender makes no sense."
          },
          {
            "score": 1,
            "body": "I disagree. Most kids who fall behind are behind because their parents, teachers, and/or the school system failed them. Punishing them will not fix that, it will set them even further back."
          },
          {
            "score": 2,
            "body": "False convictions exist, you know."
          },
          {
            "score": 2,
            "body": "While I strongly disagree with the current system, letting girls/women get away with things men and boys couldn’t solely because of their gender is ridiculous."
          },
          {
            "score": 1,
            "body": "No. The fetus, even if alive, has no right to use another’s body against their will."
          },
          {
            "score": 2,
            "body": "I disagree because third places have things most homes don’t, like more space and specific activities. Even if not, you get far more in-person social interaction in third spaces."
          },
          {
            "score": 2,
            "body": "Interesting. I don’t think my area has anything like that. For accessibility, though, there’s still the concern of having to show up by a certain time - that can be hard if you have to walk there, especially if you have places you need to be (like a job interview or doctor’s appointment)."
          },
          {
            "score": 1,
            "body": "COVID may bias things, but that doesn’t make everything before or during COVID moot. Look up Rebecca Riley, a 4-year-old who died as a result of being made to take medication for bipolar disorder. Look up Catherine Stent, who committed suicide after years of having her life and future taken from her."
          },
          {
            "score": 1,
            "body": "There aren’t many studies on this because most people don’t bother to look. You can find some on Mad in America, but if I showed those to you you’d just claim the site was biased (which it is, but so are all studies). 3 years is far too short of a timeframe - I could probably find you articles, but not from that recently because most survivors take years to share their story or to have others speak up for them."
          }
        ]
      },
      {
        "score": 1,
        "body": "least popular r/trueunpopularopinion opinion",
        "author": "AITAenjoyer",
        "author_hot_comments": [
          {
            "score": 21,
            "body": "https://preview.redd.it/qm8p4fgejbkf1.jpeg?width=1080&format=pjpg&auto=webp&s=324aad007d478a060b31f7cdca91ffaa14d8c3f7"
          },
          {
            "score": 5,
            "body": "penguin"
          },
          {
            "score": 4,
            "body": "unreasonable crashout"
          },
          {
            "score": 3,
            "body": "https://i.redd.it/vhw2ps1d0ckf1.gif"
          },
          {
            "score": 3,
            "body": "minecraft vids on PH are a different peak of content"
          },
          {
            "score": 2,
            "body": "she kept the baby and her only plan for it is to sell her fiance's pets (yes , spiders and reptiles CAN BE pets  , not just dogs or cats) , and after OP reasonably replies no, she throws a tantrum and kills OP's pet. \n\nher being SA'd is a tragedy and all , but if she decides to keep the baby , she should be able to provide for it alone or with anyone that is WILLING to help , not forced to"
          },
          {
            "score": 2,
            "body": "lmao that one is good"
          },
          {
            "score": 15,
            "body": "top 10 anime betrayals"
          },
          {
            "score": 113,
            "body": "ok_conversation was downvoted for the bit\n\nthe copycats are downvoted to banish them from the subreddit"
          },
          {
            "score": 1,
            "body": "i can't glaze reimo because goku solos"
          }
        ]
      }
    ]
  },
  {
    "title": "Some women claiming \" a real man this or a real man that\" say it just try to deny their undesirability or avoid accountability of their issues",
    "content": "A lot of times when you hear phrases like “a real man is…” or “a real man does…”, it’s less about some universal truth and more about someone pushing their own narrative to avoid accountability when it comes to denying they have undesirable traits or history. People often use that phrase to justify what they want in a partner or to shame behavior they don’t like. For example, someone might say “a real man pays for everything” or “a real man never judges my sexual history” — but those are just projections of personal expectations, or insecurities. It's not an objective definition of manhood.\n\nWe all know some men don't like dating single moms, promiscuous people, S workers, high body count holders or anything along those lines. They claim that a real man accepts this or what when in reality most self respecting men don't. They try to shame the standards men have. I'm sure some men don't mind, that's ok but majority I see it's people say a real man this is to avoid accountability or justify not wanting certain traits in a partner as shaming, instead of admitting their own issues they try to avoid the fact that most men don't want a person like them and if a guy doesn't then he’s “less of a man.” In reality, being a “real man” isn’t somehting that can be shifted to your own narrative.\n\n\nIt becomes a tool of control, manipulation and validation.",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1mu6x01/some_women_claiming_a_real_man_this_or_a_real_man/",
    "score": 35,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1mu6x01",
    "bertscore_f1": 0.5315536856651306,
    "bertscore_precision": 0.5241620540618896,
    "bertscore_recall": 0.5391568541526794,
    "top_level_comments": [
      {
        "score": 13,
        "body": "Literally anyone of any gender who says “a real man/woman…..” can basically be ignored in 99.9% of situations because you know they are gonna say some dumb shit \n\nAll humans are varied. There isn’t a single true way to experience and express gender",
        "author": "SparkleSelkie",
        "author_hot_comments": [
          {
            "score": 682,
            "body": "They look like some sort of one of them tells the truth one of them lies guardians, I love it lol"
          },
          {
            "score": 189,
            "body": "> I feel like I need to be punished \n\nGirl for the love of god chill please ;-;\n\nYou had some slightly less than responsible sex and you are taking the steps to handle it. You are a drown ass woman, not a child that needs a time out"
          },
          {
            "score": 12,
            "body": "Masculine energy, feminine energy, whatever energy. It’s all bullshit nonsense. I. Do. Not. Care. I’m not going to live my life through how straight people see gender. Fuck that noise. Ignore completely.\n\nI’m hyper femme as fuck , I have a tongue like quicksilver, and I know how to fight. End of story."
          },
          {
            "score": 7,
            "body": "Ayyyyyy, congrats!\n\nI made some really damn good potatoes tonight. Not quite as cool but still good :]"
          },
          {
            "score": 12,
            "body": "This doesn’t read as a wlw post *at all*\n\nWhen I see this my immediate thought is you are either a dude pretending to be a woman to get nudes. Or you are someone already in a relationship that is going to spring a boyfriend/husband on me, and potentially you are cheating on him or you are just acting as threesome bait (or you ARE the boyfriend/husband)\n\nLike obviously I do not *actually* know your situation, but that’s just kinda the thing the post gives off. Like it reads just like a unicorn hunter profile on online dating platforms. Has very copy paste generic semi-fake female profile vibes. Nothing about it feels genuine, and all the phrasing is kinda sus (“fun, open minded, genuine connection” for example)\n\nAlso the combination of “I swear I look so young!”, “cis only”, and a preference for online communication with real life being a maybe? Entirely off putting for me. \n\nI’m absolutely not trying to be a dick, but I wouldn’t go near any of this with a ten foot pole. I think you would be better off typing in your own voice, rather than making it look like an ad"
          },
          {
            "score": 10,
            "body": "Proud to be the designated Carrier of Drunk Ladies in my friend group 😂"
          },
          {
            "score": 20,
            "body": "Most of the time it’s because being around someone actively disordered is going to make them relapse\n\nIt’s not about you as a person, they are just doing what they have to to keep themselves from getting sick again. IME it is totally possible to become close friends again if you recover well enough though"
          },
          {
            "score": 15,
            "body": "Nope! \n\nIME you just go “what the fuck why do I look so big still” and then keep forcing yourself to lose even though in reality you look too thin and sick as hell\n\nThese disorders don’t provide happiness or satisfaction in any long term way"
          },
          {
            "score": 1,
            "body": "Hard no.\n\nYou put the *whole* seat down with the lid before you flush so that you don’t spray fecal particles all over the bathroom. That is like the objectively correct way to use and flush the toilet \n\nNo point in opening it back up again after that"
          },
          {
            "score": 18,
            "body": "> have you ever looked at a person and gone, wow, that person has some really ugly eyes?\n\nYes. It has happened once in my life, and let me tell you it was *weird* seeing someone that actually had eyes like that. I tend to agree with you in general, but that one guy proves you wrong"
          }
        ]
      },
      {
        "score": 3,
        "body": "I'm a cis-het male, and I think \"real man\" is a plain embarrassing label. It insults individuality by saying a man has to be this that these those, etc. to be worthy of respect.  Thus, even by a lot of popular standards, a \"sure-enough 'omega male'\" who cares not what others think of him is more manly than a flexing cocky show-off who worried about wearing clothes that are \"too sissy\".  Also, one person's (male or female) \"strong, smart, brave, badass protector\" is another's \"semi-psychopathic hairless baboon\".\n\nAt best, \"real man\" is subjective; at worst, shaming language to get men to conform to crap popular imagery.",
        "author": "filrabat",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Receipts to back up your claims or you're spewing bullshit."
          },
          {
            "score": 1,
            "body": "Really? All you do is argue from caricature, no doubt that comes from your pathetic lack of critical thinking skills (i.e., can't tell the difference between the actual truth and a mere presumption). Half my graduating year classmates during their and my high school years could argue half-truths more convincingly than you can.  What you assert without evidence I can reject without evidence (Christopher Hitchens, he was a real thinker, who you should take lessons from)\n\nIf you really are so sure about your claim, hop over to that subreddit. You know where to find us.\n\nAnyway, it's getting a bit late over here, so I gotta earn my keep. Great bantering with you."
          },
          {
            "score": 1,
            "body": "Why?  Because H1Bs can get paid cheaper and get more work restrictions. In effect, it's Silicon Sweatshop.  People from other countries come here trying to make it in the US, but get underpaid relative to their native-born counterparts.  Unlike picking vegetables, which few to no Americans want to do (or even can do fast enough), these tech jobs are doable by a large number of sufficiently educated native-borns."
          },
          {
            "score": 1,
            "body": "How to get ahold of yourself. First, think long and hard about what makes you you, so to speak. That means your core values and attitudes you discovered about yourself by asking \n\n\"If I'm A, then what is it that makes me A?\".   \n\"Because of B\".  \n\"If I'm B, then what is it that makes me B?\"  \n\"Because of C\",\n\nand so on down the alphabet. \n\nThen you'll find your ultimate core self, and I mean the best part of your core self, that which makes you truly happy and content, and hold on to it. Keep aware of it at all times. Then, you'll find things beyond getting a girl that truly make you the real you (and for that matter, conforming to society's expectations in general). \n\nThen, find some topic that fascinates you and throw yourself into it deeply. Learn everything you can about it. Also helpful, learn about critical thinking skills and use them on really controversial topics. Doing that will clear your mind of bullshit like you wouldn't believe. You'll be amazed at how much of what you think you want is just cultural conditioning, keeping you from even seeing your authentic self, let alone being true to it."
          },
          {
            "score": 1,
            "body": "And I don't believe you're into MMA and combat sports AND work in Silicon Valley tech.  Anybody who claims to be \"all this\" and \"all that\" on the Internet rarely is so. I know where I'd put my $100 that your claim isn't bogus."
          },
          {
            "score": 1,
            "body": "IF widespread enough that it creates permanent population decline forever and ever, amen (metaphor only), THEN yes that is the consequence of widespread AN. However, if decline happens, it should be graceful and voluntary - a person's full choice. Involuntary means are unethical (and bringing them up will get you banned from this subreddit).\n\nYet, the human species (or its descendant ones) are going to go extinct one day anyway - via the \"Heat Death of the Universe\", if no other way (and probably some other means far before heat death).  Therefore, I see no point in \"crying\" about my \"not having a legacy\". Everybody's legacy will be erased some how, no matter how far in the future. And who will remember us after we're all gone?"
          },
          {
            "score": 1,
            "body": "Yes. The only reason I dignified your question is that you have no concept of *Ad Hominem* and *Well Poisoning*, both well-known fallacies (flaws in logic, for those uneducated in philosophy).  Therefore, I shouldn't expect you to know the basics of argumentation. You're just a mirror Mr Spock: All emotion and no logic. If you can't bring yourself to stop assuming your basebrain impulses are \"true beyond doubt\", then there's no point in discussing this with you."
          },
          {
            "score": 1,
            "body": "We call it beautiful due to random programming in our brain and/or DNA. There might be a bit of blurry boundary with this one.  Regardless, it's just \"nature\" pre-programming us to want to experience something so much (in this case, beauty) that it blinds us to the hard reality of the world and life. \n\nThink of life as being beautiful like a coral snake (if in the Americas) or a krait (if in Asia)."
          },
          {
            "score": 1,
            "body": "Vast majority? Got some stats to prove that, or are you just assuming the general media image is a reality.  Your claims make as much sense as saying \"All Blacks are \\_\\_\\_\\_\\_\", \"All women are \\_\\_\\_\\_\\_\".\n\nWhere's your stats to back up your claim that they're antisocial and don't have a job and so forth? Even assuming you do have high-cred stats, the causality is just as well reversed.  Some people just can't contribute to sociey, and society's abrupt judgement as \"low worth\" causes them to withdraw. Classic Catch-22.\n\nAlso, I'd be careful where you go with that \"resources\" response. Let's me simply say that in the last century, that led to some  [extreme](https://encyclopedia.ushmm.org/content/en/article/euthanasia-program) [outcomes](https://www.npr.org/2011/12/28/144375339/a-brutal-chapter-in-north-carolinas-eugenics-past) .\n\nNobody should be allowed to live that way? At this point, I'll just say \"Who made YOU God\".\n\nIt's obvious you are drive more than basebrain personal distaste, not the rational thought process. The only reason incels and others you mentioned are bad is because your impulses and society says so. Neither are any longer a practical basis for sizing up one's worth - if they ever were ones."
          },
          {
            "score": 1,
            "body": "Like I said, if involuntary celibates (able-bodied or not) aren't hurting anybody else, then your the one with the problem."
          }
        ]
      },
      {
        "score": 1,
        "body": "It's crazy being lectured about masculinity by women who couldn't be half as feminine as their grannies were",
        "author": "Due_Essay447",
        "author_hot_comments": [
          {
            "score": 129,
            "body": "Love the game, but you can tell their QA is just 1 guy manually clicking buttons"
          },
          {
            "score": 24,
            "body": "Truly saving the gaming industry 1 step at a time"
          },
          {
            "score": 268,
            "body": "How poofy her thief costume is, combined with her always wearing baggy sweaters.\n\nContrast that with the other girls all having form fitting skinsuits."
          },
          {
            "score": 3,
            "body": "Even if they equalized stats, difference in weapon and awareness would make 2 of the same characters vastly different."
          },
          {
            "score": 9,
            "body": "no"
          },
          {
            "score": 11,
            "body": "I'm almost certain that isn't the context here. Homie probably popped his shoe mid shift and they are reaming him for it.\n\nOn another note though, I know she ain't making fun of people with that laugh"
          },
          {
            "score": 1,
            "body": "I'd question why that person wants to be an engineer specifically. It clearly isn't something they are interested in, and it doesn't align with their interests.\n\nSame can be said about women. Don't chase the ones that require you to become someone you clearly aren't.\n\nDating isn't so integral to life that you should compromise on your own individuality."
          },
          {
            "score": 1,
            "body": "What an oxymoron. Can you call anything someone going on a hike of their own accord does lazy?"
          },
          {
            "score": 3,
            "body": "If you ignore supply and demand sure.\n\nJust because something was a hot commodity in december, doesn't mean it is a hot commodity in july.\n\nDo you think christmas trees always have a massive margin just because they get heavily discounted in the summer?"
          },
          {
            "score": 1,
            "body": "\"Software Engineer\"\n\nThen I list the tools I know and the implementations I do"
          }
        ]
      },
      {
        "score": 1,
        "body": "Exactly 💀. That whole “a real man…” line is usually just a shortcut for someone avoiding self-reflection. Instead of acknowledging their own flaws or incompatibilities, they project expectations onto others and wrap it up like it’s some universal truth. It’s less about actual morality or masculinity and more about control and justification.\n\nMost of the time it’s a mix of insecurity and entitlement — trying to shame people who don’t fit their personal fantasy while ignoring that attraction and standards are subjective. A “real man” isn’t defined by anyone else’s checklist; it’s about integrity, respect, and accountability — not bending reality to protect your ego. ✌️",
        "author": "shayazer",
        "author_hot_comments": []
      },
      {
        "score": 1,
        "body": "Yes. That is internalized patriarchy reinforcing gender roles. Fight the gender binary, my agender sibling!",
        "author": "pavilionaire2022",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Yes!"
          },
          {
            "score": 1,
            "body": ">It started off in good faith, people were calling out ACTUAL predatory age gaps (Like 25 and 16  or 30 and 17 for example)\n\nWhat about 30 and 18? Some people would say, \"She's legal!\" but most people would say it's problematic. Of course, on a case by case basis, maybe sometimes it's fine, but the majority of the time, it's probably unhealthy. And no one is saying they should be forcibly separated, just that they would _advise_ those two to rethink their relationship."
          },
          {
            "score": 1,
            "body": ">So what do we do? Just stop cracking down on crime? \n\nFix poverty. The point is often that additional spending on policing should be instead spent on programs that address poverty. The spending might be similarly effective at preventing crime while being more humane."
          },
          {
            "score": 1,
            "body": ">We can only assume that leadership and powerful interests opposed the bills. Durbin is now retiring.\n\nQuite possibly, but I see no reason to single out Democrats as blocking the reform. Quite likely, the powerful interests have friends among both Democrats and Republicans."
          },
          {
            "score": 1,
            "body": "Everybody else says it's size insecurity. They're probably right, but in case they're not, maybe he gets turned off by medical terms.\n\nIdk. He's pretty immature if he can't talk to you about it and tell you why it bothered him."
          },
          {
            "score": 1,
            "body": ">It said: “Find the length of the arc of a circle of radius 2 meters, subtended by a central angle of 0.25 radian.”\n\n>At first, I wondered if radian even applied here, since the definition had mentioned the vertex needing to be at the center of the circle, and this question doesn’t specify that.\n\nIt does. It says, \"central angle\", and the definition of central angle is:\n\n>A central angle is a positive angle whose vertex is at the center of the circle.\n\n>If 0.25 radians is 1/4 of the radius, so doesn’t it follow that radius and radian are always equal? But if that is the case, why does the definition talk about central angles? Wouldn’t it be simpler just to say, “1 radian is equal to the radius of the given circle”, or am I missing something?\n\nYou are missing something. 0.25 radians is not 1/4 of the radius, which is 2m. 1/4 of 2m is 0.5m, which is the answer. Radians don't have a dimension of length. Radians are a unitless dimension. They are the dimension of a ratio of length to length: m/m = 1.\n\nA radian itself can't be equal to the length of the radius. An arc with angle 1 radian has length equal to the radius, but we don't say the angle measuring 1 radian has a length."
          },
          {
            "score": 130,
            "body": "I made my dwarves Appalachian. Remember, you don't only have to use European accents."
          },
          {
            "score": 1,
            "body": ">Part of me is worried that since we have such a strong sexual connection/chemistry, not having sex will push us apart.\n\nIf all you've got going is sex, that would be good to find out."
          },
          {
            "score": 1,
            "body": "Why would Democrats fight an unimportant losing battle when there are so many important losing battles for them to fight?"
          },
          {
            "score": 1,
            "body": ">Agreed but if you bring this up Democrats are quick to call you racist\n\nName names. I have not heard of Democrats opposing H1B reform. Is this something you've heard about or just assume?"
          }
        ]
      },
      {
        "score": 1,
        "body": "That goes either way, women also get the same rhetoric.\nI disagree with the denying their own undesirability and whatnot. What they want to say here is that they do not find the behaviors acceptable for what they consider a \"real man/woman\". It's similar to the post - it's assuming that you would know if any of those things are true.\nThere's an old couple at the pool I go to and the old man kinda rushes in past his wife to get in the pool instead of helping her and holding the door (she's in a walker) \nMy mom will say \"he's not a real man\" because the behavior is not congruent with the behavior she believes makes a good man. My dad always does things like that for her, so it's certainly not a desirability or avoiding accountability thing. \nIt's about the behavior. That's pretty much it.",
        "author": "Nidus-Zealot",
        "author_hot_comments": [
          {
            "score": 9,
            "body": "I don't because it's not on the female model"
          },
          {
            "score": 1,
            "body": "Same but I want the pose on the grill."
          },
          {
            "score": 2,
            "body": "I think the problem is more women will say \"women have as much value as men\" when faced with inequity. Men face what they perceive as an inequity and will say \"women have less value\"."
          },
          {
            "score": 1,
            "body": "Yeah that's what I'm getting at.\nMen and women also accuse other men and women based on this so OP isn't correct on his reasoning being the insecurity of the scolder, but instead a condemnation of another based on the viewpoint of the scolder."
          },
          {
            "score": 3,
            "body": "That's just nidus phryke with less drip"
          },
          {
            "score": 1,
            "body": "That goes either way, women also get the same rhetoric.\nI disagree with the denying their own undesirability and whatnot. What they want to say here is that they do not find the behaviors acceptable for what they consider a \"real man/woman\". It's similar to the post - it's assuming that you would know if any of those things are true.\nThere's an old couple at the pool I go to and the old man kinda rushes in past his wife to get in the pool instead of helping her and holding the door (she's in a walker) \nMy mom will say \"he's not a real man\" because the behavior is not congruent with the behavior she believes makes a good man. My dad always does things like that for her, so it's certainly not a desirability or avoiding accountability thing. \nIt's about the behavior. That's pretty much it."
          },
          {
            "score": 1,
            "body": "What did your mom never tell you a lie to keep you safe? She dipped out for a hot minute in one quest because trying to figure out how to deal with all of that took precedence. Not like a great move but not done maliciously. The whole new war stuff was literally brainwashing and psychological shit being done by Ballas. Lotus has her own demons and isn't infallible but she's been fighting the void on our behalf for a long while now. She's literally on that ledge in the Sanctum at this point in the story fending it off to facilitate the 1999 events."
          },
          {
            "score": 1,
            "body": "Nah, she already had her \"villian\" arc. No reason to do it again it would be redundant and pretty character breaking. She's like your mom in the same way that you grow up and realize she is also a whole person aside from \"mom\". Something like the \"maiden-mother-matron\" dynamic being explored. Anyway. Not evil."
          },
          {
            "score": 1,
            "body": "It is impossible to resist being cringe no matter how old you are. Just wait another 10 years and we will see another evolution."
          },
          {
            "score": 1,
            "body": "Make it do toxin damage (iykyk)"
          }
        ]
      },
      {
        "score": 1,
        "body": "Another day, another aggrieved post about women. It's probably time to rename this forum on the basis of the volume of posts expressing their barely veiled issues with women.",
        "author": "DellaDiablo",
        "author_hot_comments": []
      },
      {
        "score": 1,
        "body": "It has the same validity as a man saying \"a real woman this or a real woman that\". Absolutely none. It serves as a good filter for stupid people.",
        "author": "TransmissionsSigned",
        "author_hot_comments": [
          {
            "score": 1,
            "body": ">Si sabes que congelar el tiempo implica afectar el espacio verdad? Ya que detener el tiempo implica afectar el espacio + tiempo ya que estás dos van de la mano y esto está por encima de las matemáticas convencionales de Gojo.\n\nDon't try to adapt real world physics to this, it makes no sense. If infinity divides the space such that Esdeath can never touch Gojo, it doesn't matter that time is stopped, because Esdeath keeps moving through space.\n\n>Aprende sobre dimensionalidad o incluso algo de física, \n\nIronic."
          },
          {
            "score": 1,
            "body": ">So, why should men keep giving attention when they receive none?\n\nThis? But:\n\n>Interestingly enough, what men do always catches their attention. They want to know what men are up to, even if men are \"ill intentioned as a majority\"\n\nWhich is what you're doing. You care that they care, aka, attention.\n\n\"But I didn't say they are ill intentioned as a majority!\". Exhibit A:\n\n>*As long as men give them attention, men are a tool for self esteem*\n\nStill, I don't care enough about the humor in the situation to argue. Cheerio."
          },
          {
            "score": 1,
            "body": "From Yamcha to Grand Priest, depends on the Superman version."
          },
          {
            "score": 1,
            "body": "Gojo."
          },
          {
            "score": 1,
            "body": "https://preview.redd.it/mnrinpjpz9kf1.png?width=1080&format=png&auto=webp&s=95e4e9981e60fc816fe500b0054b9ad198fe4467\n\nThere."
          },
          {
            "score": 1,
            "body": "That this post is about you caring about what women do, while generalising them in a way which implies you probably don't like them very much. It's funny, is all, didn't mean to offend."
          },
          {
            "score": 1,
            "body": "Unsurprising. "
          },
          {
            "score": 1,
            "body": "I just get bored and start something else. I've never felt guilty about it. Just today I dropped Ender in Exile, and I couldn't be happier."
          },
          {
            "score": 1,
            "body": "I was 7. I had a friend who said he was smarter than me. To prove it, he read Matilda, by Roald Dahl. \n\n\nI was confident he was wrong. To prove it, I read David Copperfield, by Charles Dickens.\n\n\nIt all fell into place from then."
          },
          {
            "score": 1,
            "body": ">So how, then, can you really tell whether or not someone else is confident in themselves without being obnoxious, yourself?\n\nIt's not what you *are*, it's what you *come off as*. There are some behaviours that read as obnoxious even if that's not the intention. For example, I know a guy that knows when he's right, he's confident about it. No one likes him because it's always his priority to show how he's right and you're not. It's obnoxious.\n\n>if - for example - if someone doesn't like me then they get to say I'm \"not there\" yet.\n\nIf someone doesn't like you, you could be Henry Cavill himself, it wouldn't matter. Being confident only helps *before* you know someone in my experience. I know where you're going with this, but I don't think it applies. Most people probably don't dislike you because you're ugly. If that were the case, most ugly people would be alone and they are not. Such a social bias exists, and I can't know the extent of it, but many of the people I consider ugly live full social lives.\n\nWhen I was younger, I thought everyone hated me when they actually didn't. I was sure that people disliked me upon laying eyes on me and that I had 'something' fundamentally unlikable. Is it possible you're going through something similar?\n\n>what makes someone appealing isn't actually this notion of \"confidence\" but rather something else.\n\nYes, of course. It's not that confidence makes you appealing, it's that the lack of it makes you unappealing. For example, I'm fairly good looking, but since I had the confidence of a wet sock, when I was approached it didn't tend to last long UNLESS I was comfortable for whatever reason, which made me more confident.\n\nYou are not going to become desirable just because you're confident, but it helps to show people *you*. When people who love you tell you to be confident, they probably think you are worth showing. When people on Reddit say it, they are being parrots.\n\n>In the end it is all subjective; one thing that true confidence *shouldn't* be doing is making you think you know everything, because you really don't.\n\nTrue confidence is just not giving a crap, I think. That's why it's so hard to get or fake, because if you care about being confident, you aren't. When you care, you crave validatio and that becomes obnoxious, which is commonly lumped in with 'overconfidence'.\n\nSome people have other positive qualities that allow them to be obnoxious and still find success. They are not being rewarded for being obnoxious, but in spite of it. Their other qualities just cancel it out. Looks are a common example because you don't have to work through a person's personality to see them, unlike humor, kindness, etc; which take longer."
          }
        ]
      },
      {
        "score": 1,
        "body": "In summary: anything bad that happens to me as a woman is somehow a man's fault. This has been going on since the '70s. Something big must have happened in the '70s that affected how people talk about gender. I can't put my finger on it.",
        "author": "Snoo_90208",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "I'll go you one better: I hate when public places have one-at-a-time bathrooms labeled Men and Women. I mean, if it's one-at-a-time, then who cares what sex you are when you go in? I can't tell you how many times I have waited outside a \"Men's\" one-at-a-time bathroom like an idiot while the \"Women's\" was free, and i just wanted to wash my hands. Because I don't want to get yelled at by anyone."
          },
          {
            "score": 1,
            "body": "There will never be a solution to homelessness until we all admit that it's not a housing issue: it's a drug addiction issue."
          },
          {
            "score": 1,
            "body": "If you are someone who really can't stand that Trump was elected president ... twice (and, trust me, I know how you feel), you need to ask yourself: how did we get here?\n\nFor instance, would we be seeing the aggressive ICE raids going on if millions of immigrants had just waltzed across the border like it was nothing over the past decade? Would we be seeing executive orders saying there are only two genders if we hadn't seen girls across the nation getting knocked off the podium by biological males? Would we see all of the funds being cut off from universities if they weren't overrun by activists supporting known terrorist organizations?\n\nWhen you start putting things into context, you realize that Trump didn't appear on the scene because Americans are assholes. He is where he is now, because many, many Americans are fed up with feeling as though they are invisible and have no voice. SO, as others have said, if you don't like the symptom, then try and understand what the cause is so you can treat it. Stop pretending the cause doesn't exist or is something else than what it really is, or you will just see more Trump-esque candidates gaining popularity."
          },
          {
            "score": 1,
            "body": "Bravo. You have posted a TRUE UNPOPULAR OPINION. Most of the folks who frequent here seem to love it."
          },
          {
            "score": 161,
            "body": "To kill the vibe at gay bars."
          },
          {
            "score": 1,
            "body": "As is the case with so much of the hollow rhetoric bouncing around, land acknowledgements are nothing more than lazy virtue-signaling, allowing middle-class white suburbanites to pat themselves on the back for saying the right thing. If you ever encounter it, simply ask why we haven't just given the land back, and that usually ends the conversation."
          },
          {
            "score": 6,
            "body": "Ha ha. Skittle squad. I love it.\n\nSeriously, though, I think most of America is fed up with this silly rhetoric that there's all this phony persecution going on. Like ... when was Yosemite not an \"inclusive\" place? Never."
          },
          {
            "score": 4,
            "body": "Speaking as a life-long Californian, this state is a sad shadow of what it was when Reagan was governor. Not even in the same ballpark, politically, so it's not exactly an apples-to-apples comparison."
          },
          {
            "score": 2,
            "body": "2.6 seconds. No more. No less."
          },
          {
            "score": 2,
            "body": "Let me rephrase your question so it's more to the point: What do I do about bad customer service?\n\nAnswer: Take your business elsewhere."
          }
        ]
      },
      {
        "score": 1,
        "body": "A real man means you should be able to go with the flow in the situation. They shouldn't feel safe with you. If it's about dollars cost them over the side of a boat",
        "author": "JS6790",
        "author_hot_comments": [
          {
            "score": 8,
            "body": "I have a feeling.There is a lot of context missing"
          },
          {
            "score": 0,
            "body": "You've been together 6 years and never talked about kids ever.\nWhat the fuck."
          },
          {
            "score": 1,
            "body": "There is a difference between stupid questions and rage bait"
          },
          {
            "score": 3,
            "body": "If he was juggling chainsaws would you also come to reddit to ask?"
          },
          {
            "score": 3,
            "body": "No.\nAnd what do you consider a lot?"
          },
          {
            "score": 1,
            "body": "Keep going troll. When you move out of your parents' house let me know."
          },
          {
            "score": 0,
            "body": "Outside outside of laser.No that's why many people use hair removal. Or you know they just shave."
          },
          {
            "score": 0,
            "body": "Just because you have your headphones on doesn't mean it's silent to other people. Just because someone disagrees doesn't mean their controlling in paranoid grow up or shut up"
          },
          {
            "score": 1,
            "body": "There is someone for everybody. Getting cheap eat better you'll feel better"
          },
          {
            "score": 0,
            "body": "If your music is loud enough that either you can't hear anything else or it's loud enough that other people can hear it's a bad thing"
          }
        ]
      }
    ]
  },
  {
    "title": "Stating the fact that only opposite sexes are biologically complementary isn't homophobic",
    "content": "The following is a true unpopular opinion these days.  People will have an extremely hard time not to consider my point hateful even though I am stating simple facts.\n\nIt is possible to acknowledge the fact that we are biologically designed to only mate with the opposite sex while also supporting the rights of people to do whatever they want with their lives.\n\nI have no homophobic bone in my body, but I also realize that our biology makes it clear that we are meant to be only be sexual with the opposite sex.\n\nYou may also be shocked that I have done my fair share of sexual experimentation with the same sex, but I just couldn't see it as something my body is meant to do.\n\nI also must emphasize that I do realize that sexuality isn't a choice. That's part of the reason why I support all sexualities, but there is no factual way to argue that we are  anatomically and biologically designed to engage in same sex sex.\n\nThese are my beliefs. Regardless of my views, I don't think it's appropriate to be unkind to others due to their sexuality.\n\nBlunt and honest posts don't usually do well, but I believe that the truth also must be spoken.\n\nNo, I am not religious at all, if it makes a difference.",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1mtzlz2/stating_the_fact_that_only_opposite_sexes_are/",
    "score": 71,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1mtzlz2",
    "bertscore_f1": 0.5209155678749084,
    "bertscore_precision": 0.5218898057937622,
    "bertscore_recall": 0.5199449062347412,
    "top_level_comments": [
      {
        "score": 49,
        "body": "Creator made male g spots inside and two of the closest genetic relatives to humans both socially exhibit same sex relationships, though Bonobos far more than Chimpanzees. \n\nHumans are social creatures with weird social habits and any emergency medical professional will tell you that humans also have a tendency to occasionally stick illogical things up there.",
        "author": "PWcrash",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "So we went from dense to obnoxious now? Do you have anything about the actual subject to add?"
          },
          {
            "score": 1,
            "body": "Yet no one ever seems to make fun of the middle aged man single handedly fighting off a twenty men half his age often more heavily armed nearly as much."
          },
          {
            "score": 1,
            "body": "Then stop being facetious."
          },
          {
            "score": 1,
            "body": "I'm being dense? In what world do you live in where you can expect to start a rebellion and just have what you want handed to you? Rebellions are a gamble. They end very badly if you don't win. \n\nRebellions are declarations of war and war is only glorious for a few abled bodied survivors and those that can watch on from afar and leech off national pride while being in no danger in the first place. \n\nIt sucks for everyone else. \n\nAnd the Confederacy was a terribly thought out rebellion in the first place. They thought of themselves as the next American revolution but they didn't have the two key elements that the revolutionary war had to succeed. \n\n1. They failed to get any foreign recognition and support. The most they got was some limited trade. \n\n2. They didn't have the geographical advantage of being across an ocean and their enemy having to fund the distance to constantly send more forces across said ocean. \n\nSo why would you put your families and homes in the middle of a war that you had an almost definite chance of losing?"
          },
          {
            "score": 1,
            "body": "You mean the army that responded to aggressors that decided to betray their nation and bombard a fort for 34 hours? That \"invading army\"?"
          },
          {
            "score": 1,
            "body": "The Civil War was already inevitable before Lincoln was inaugurated. Confederate Warships began their bombardment of fort Sumter 1 month and a week after he became president. \n\n>\"My paramount object in this struggle is to save the Union, and is not either to save or destroy slavery. If I could save the Union without freeing any slave I would do it, and if I could save it by freeing all the slaves I would do it; and if I could save it by freeing some and leaving others alone I would also do that\"\n\nIt's also important to note that Lincoln was still trying for some form of compromising attitude even though at this point anyone in government with a brain knew that even without all of the contention between people, the US states could not keep fighting with two conflicting economies for much longer if it wanted any chance at keeping up with Europe. Something had to give.\n\nGiven that the industrial revolution was also happening in Europe at this time you can probably guess which side was always meant to come out the victor if the US wanted to stand a chance at not becoming once again a big messy pizza pie split between several European countries that outcompeted them in military and trade."
          },
          {
            "score": 1,
            "body": "Only if you consider calling out people's deliberate delusions of history as \"bad faith\"\n\nFunny how only during discussions of the civil war people start magically forgetting basic vocabulary to try to fit their own confirmation bias. \n\nThe Confederacy was bad, the slave system that was the backbone of it was bad, and the people who defended it were not necessarily bad, but they did do bad things against their own interests and against others because they didn't know any better. They were brainwashed."
          },
          {
            "score": 1,
            "body": "Another lie. \n\nThe union did not have a \"take no prisoners policy\" as much as they halted prisoner of war exchanges after the Confederates killed a bunch of Union soldiers that were surrendering."
          },
          {
            "score": 1,
            "body": "It's not that I don't like it, it's just that it doesn't make any sense.\n\nYou can't claim self defense for starting a rebellion and that rebellion getting treated like a rebellion. The first acts of aggression were by Confederate warships on April 12th 1861. \n\nThere is no Truth whatsoever to any claims of \" self-defense\" against northerners. \n\nThey. Attacked. First"
          },
          {
            "score": 1,
            "body": "There was no defending, the South attempted to secede. No one invaded until they tried to break the union. IE they were treated like any other rebellion that came before. It's not like it was the first one"
          }
        ]
      },
      {
        "score": 27,
        "body": "Man, this denial is for you to hash out with your therapist, not with us.",
        "author": "UnscentedSoundtrack",
        "author_hot_comments": [
          {
            "score": 2,
            "body": "Trees do in fact compete for resources, the most obvious one being sunlight."
          },
          {
            "score": 1,
            "body": "How are they a scam?"
          },
          {
            "score": 1,
            "body": "Is gay marriage not a scam?"
          },
          {
            "score": 1,
            "body": "Believe it or not, some people love and enjoy their kids."
          },
          {
            "score": 0,
            "body": "Are you admitting you’re a scammer?\n\nI mean, you are your parents’ kid. Would you say your value is a zero return to your parents’ investment?"
          },
          {
            "score": 1,
            "body": "Jesus, half of this thread can be tagged with “I’m 14 and this is deep”"
          },
          {
            "score": 1,
            "body": "I don’t know about you, but I make money when I work."
          },
          {
            "score": 1,
            "body": "Yes, you own it."
          },
          {
            "score": 1,
            "body": "Even then, it takes around 6 years or so to fully complete the forfeiture process due to unpaid taxes, at least around my neck of the woods, and that is if you do fuck all."
          },
          {
            "score": 1,
            "body": "I agree that permissiveness is a horrible way to parent, but I disagree with the notion that the only two practical options are spanking or nothing. Parents have used other forms of discipline other than spanking for a really long time (I’d say since humans are humans), and they continue to do it now."
          }
        ]
      },
      {
        "score": 21,
        "body": "That's not a fact it's an opinion, something being \"complementary\" is purely subjective. \n\n\nYou're free to have whatever subjective opinions you like but it isn't smart to mistake those opinions for a fact. ",
        "author": "Level_Inevitable6089",
        "author_hot_comments": [
          {
            "score": 4,
            "body": "So your advice is to roll over and accept disenfranchisement? "
          },
          {
            "score": 7,
            "body": "Hardly fighting if asking for a handout."
          },
          {
            "score": 23,
            "body": "That's not a fact it's an opinion, something being \"complementary\" is purely subjective. \n\n\nYou're free to have whatever subjective opinions you like but it isn't smart to mistake those opinions for a fact. "
          },
          {
            "score": 13,
            "body": "Just remember that your opinions on what is \"complementary\" in biology isn't a fact and absolutely is subjective. "
          },
          {
            "score": 15,
            "body": "No, I'm saying that the biological processes like procreation being something as fuzzy as \"complimentary\" is an opinion.\n\n\nIf you said \"stating the fact that only the opposite biological sexes can procreate in humans isn't homophobic\" you'd absolutely be right. \n\n\nSaying that same sex couples aren't \"biological complementary\" means nothing to anybody but you. \n\n\nIt would be like saying that opposite sex couples aren't \"biologically consistent\"I could make up any meaning for\" consistent\" but that wouldn't turn it into a fact. "
          },
          {
            "score": 8,
            "body": "I'm just using the OP's verbiage. He's clearly referring to cis male/female heterosexual couples. "
          },
          {
            "score": 3,
            "body": "As I pointed out I was just using your verbiage.\n\n\nAnd I don't see how an orange is the opposite of an apple or how a hand is glove. \n\n\nAnd that's the point isn't it. You aren't talking about facts your talking about your opinion on same sex relationships which by definition is subjective because it's just your opinion. "
          },
          {
            "score": -1,
            "body": "Boom. "
          },
          {
            "score": 1,
            "body": "Never ever cite the Fraser institute, they are a think tank not a research center.\n\n\nYes, wait times for things that are non-critical can be long especially for the elderly or rural patients but in general wait times are manageable for the average wait time for a hip replacement in Canada is roughly the same as in the USA, 6 months. "
          },
          {
            "score": 1,
            "body": "How about that time on Howard Stern where he bragged about watching teenage girls change? "
          }
        ]
      },
      {
        "score": 19,
        "body": "This sounds like a made up dilemma to be honest.\n\nNot a single person in the history of the planet has argued against the point that male and females are designed to copulate with each other as part of human reproduction.\n\nThe gayest gay to ever gay will tell you all about the birds and the bees.\n\nThis is not hateful, everyone knows and no one cares.\n\nEven if my hockey stick was designed for hockey I can use it for something else. The people who sound like psychos are the ones running around trying to ban me when I try to use it to it as a wizard staff.",
        "author": "M0ebius_1",
        "author_hot_comments": [
          {
            "score": 92,
            "body": "This is America now.\n\nAs long as you and I may disagree with it, that slobbenly moron is America's image to the world right now.\n\nIt's important that we don't look away."
          },
          {
            "score": 19,
            "body": "Doc Ock would specially not say this shit."
          },
          {
            "score": 10,
            "body": "\"Help me Bobby-Wan, you are my only hope.\""
          },
          {
            "score": 6,
            "body": "Picture wanting blonde woman number 6 when you can have:\n\nhttps://preview.redd.it/hqoocwv7fbkf1.jpeg?width=592&format=pjpg&auto=webp&s=8133cab27707db2e5824ebb723b9f9b5c62888af"
          },
          {
            "score": 1,
            "body": "I think that's the intent.\n\nThe gamble is that there are less Republicans and they are already jerrymandered to hell.\n\nI think an open season is what Democrats want, the idea is that Republicans have squeezed the stone dry."
          },
          {
            "score": 1,
            "body": "Happens to men too. (Or should) \n\nOnce you have one or two experiences you learn to hit skip on the hot messes.\n\nNot that you don't want a good looking partner but it becomes less and less the ONLY thing you are looking for and it's way more important how a woman treats you and what you share in common.\n\nMost guys in their mid 30s would probably tell you they wouldnt date the women they dated in college."
          },
          {
            "score": 6,
            "body": "They sent out an email offering skillbridge to advice duty for it. \n\nLike you are going to get valuable life skills out of interning as a brown shirt for six months."
          },
          {
            "score": 3,
            "body": "No one is complaining about immigration law being enforced. Obama did it much better and in greater numbers and no one complained."
          },
          {
            "score": 1,
            "body": "Survivors of banned subs and banned accounts. It's a beautiful example of two human souls yearning for connection and finding comfort in each other."
          },
          {
            "score": 1,
            "body": "You are not going to find a solution if you only work on the problem and not the cause.\n\nYou can't fix crime with just law enforcement.\n\nCops enter the picture after crime has already happened."
          }
        ]
      },
      {
        "score": 15,
        "body": "Were we biologically designed to sit in front of a computer and type out our thoughts to a bunch of strangers? \n\nAppeals to nature are BULLSHIT.",
        "author": "IpsoKinetikon",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Yea it's pretty wild sometimes, I've met people that seem to have  PHD level of knowledge on some bullshit theory. If they put as much energy into learning something useful, who knows what they could accomplish."
          },
          {
            "score": 1,
            "body": "So then we agree that sometimes suicide is acceptable and sometimes it isn't. I think we just draw the line in different places. \n\nThere are certain specific situations where I wouldn't blame the person, and some situation where I'd think they're selfishly taking the easy way out, with no regard for those who care about them."
          },
          {
            "score": 1,
            "body": ">That's just incredibly disrespectful and it's not your call to make.\n\nI have every right to say they're selfish, because I'm considering how it would impact all the people around them. \n\nWould you be cool with a father dipping out on his family forever just because he's sad that he doesn't make as much money as he imagined he would?"
          },
          {
            "score": 1,
            "body": "I said earlier it was about how it would impact the people that care about them. \n\nYou've demonstrated that you're projecting your own thoughts into the place of my arguments, so I don't think this conversation is going to be very productive. Next time you try to change someone's mind, you'll have to at least understand THEIR position first."
          },
          {
            "score": 1,
            "body": "It's not about what I desire. If you had been listening, you'd already know that."
          },
          {
            "score": 1,
            "body": "Well I do think they should consider restricting themselves, yes. I don't think people should kill themselves over something petty like not having a gf. \n\nCould be some particular cases where I'd think it's okay, but as for the examples I mentioned earlier in the thread, I'm absolutely going to advocate for people not killing themselves."
          },
          {
            "score": 1,
            "body": "I'm not determining what is bearable, you're just putting words in my mouth at this point. \n\n>What gives you that right?\n\nThe right to think someone is selfish? That's a basic human right. Why would I NOT have that right?"
          },
          {
            "score": 1,
            "body": "Then we're not going to find common ground on this. You have your beliefs and I have mine."
          },
          {
            "score": 1,
            "body": ">But who are you to say what is torture for a person and what isn't? \n\nBecause words have meaning. Just because you say something is torture, doesn't mean it is. \n\nWhat if someone sprains their ankle? It'll heal in like 2 weeks but they say it's like torture and they want to end it. Would you say no one has the right to say they can't? Should no one even say anything negative about that situation?"
          },
          {
            "score": 0,
            "body": ">The world is a shithole right now\n\nThat's a cop-out. Boohoo, life is hard. That doesn't mean it's okay to subject everyone that cares about you to that. There are people that have it far worse and they aren't offing themselves, so I don't see that as a valid excuse."
          }
        ]
      },
      {
        "score": 18,
        "body": "> I have no homophobic bone in my body, but I also realize that our biology makes it clear that we are meant to be only be sexual with the opposite sex.\n\nI found a homophobic bone in your body.",
        "author": "letaluss",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "They also told us that Trump would facilitate a peaceful transfer of power."
          },
          {
            "score": 1,
            "body": "> Atheists often try to evade god by saying we exist in a multiverse. \n\nNever met this Atheist before. They sound cool.\n\nThe position you've outlined is more like 'agnosticism' than any mainstream religion.\n\nBut even taking you at your word, you are a long-long way from demonstrating that because there is a God, it is specifically the *Christian* God, and that we have to follow his moral teachings."
          },
          {
            "score": 1,
            "body": "> If you take credit for the crime rate going down, you have to take the blame when it goes up.\n\n- Major Daniels, *The Wire*.\n\nSo when are they releasing the Epstein files? Can't wait to hear about all of the criminal Democrats inside of that. :)"
          },
          {
            "score": 1,
            "body": "Milquetoast*\n\nI think the frustration is mostly directed at our government institutions which pay defense contractors big-ass-bucks, instead of investing in like, infrastructure or healthcare or services that US citizens would directly benefit from."
          },
          {
            "score": 1,
            "body": ">  Putting 100% of the blame on schools because parents don't want to interact with their children to help them grow seems a bit unfair and was never really something they were expected to do.\n\nNo, I also blame parents and activists that ban literature and academic materials because they're afraid of critical thought. \n\n> and to excel in entrepreneurship \n\nI didn't say 'excel in entrepreneurship', actually. A fuller, more aware and conscious adult is not necessarily an excellent entrepreneur, because not everyone is going to be an excellent entrepreneur.\n\n> you are going to have a bad time. \n\nI mean, I agree. The entire array of American neoliberalism would coalesce to stop any education system that might disrupt the balance of labor and capital. \n\nBut just because something is difficult, doesn't mean it's not worth doing. \n\n> Putting 100% of the blame on schools because parents don't want to interact with their children to help them grow seems a bit unfair and was never really something they were expected to do.\n\nIt's not entirely their parents fault. Your parents were *also* given terrible Mathematics education, and so aren't as well equipped to help their children with difficult mathematical concepts as they are with say, Literature or music appreciation."
          },
          {
            "score": 1,
            "body": "> Eh, the purpose of public schools are mainly to get students to read, write, do some math and try to instill some sense of national unity. There's some accountability that needs to be put on parents shoulders if they believe they should guide their kids a certain way.\n\nYes. Reading, writing, and nationalist indoctrination are necessary skills for cheap, productive workers.\n\n> Also to be fair, we have come a long way from having most of the population be trained to work in textile mills at the start of the 20th century, so I think there has been some success.\n\nI don't think we've come a long way. The education requirements for a textile worker are much lower than most modern service industry jobs. That's why they were largely automated, after all."
          },
          {
            "score": 1,
            "body": "> Like congratulations Rebecca, you found out that if we had a perfect society, many bad things wouldn't happen. I'd love to live in socialist utopia and I think that if that were a possibility, we would have done it like yesterday\n\nRepublicans are always like \"yeah it would be nice if we tried to improve society, but a perfect society is impossible so why bother?\"\n\nReally frustrating, tbh."
          },
          {
            "score": 1,
            "body": "A fun fact for you that I learned six minutes ago: \"Milquetoast\" is a reference to a cartoon character [\"Caspar Milquetoast\"](https://en.wikipedia.org/wiki/Caspar_Milquetoast).\n\n>  but I guess that could be said to basically any part of the government as well.\n\nIDK. I think that some government investments aren't totally pointless. Like social programs, education, SNAP/EBT, stuff like that."
          },
          {
            "score": 1,
            "body": "Atheism isn't a cosmological belief system, it's a religious one. \n\n> There is evidence,but you're not going to believe anyway. And would call it mental gymnastics\n\nIf your belief system was logically derived, shouldn't it be able to withstand logical scrutiny?"
          },
          {
            "score": 1,
            "body": "So if you concede that there is no evidence for your faith-system, don't you necessarily concede that being an Atheist is a logical position?"
          }
        ]
      },
      {
        "score": 8,
        "body": "The prostate would like the have a word with you",
        "author": "ycey",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Yep, my little sister should not be going into her sophomore year when she still can’t read or do basic math. I failed 9th grade and if I wanted to stay with my class I had to pass summer school."
          },
          {
            "score": 1,
            "body": "I hate mint flavors, I’m not allergic to them I’m just sensitive. I buy toothpaste that’s not mint, sometimes it’s kids toothpaste and sometimes it’s “HIS” toothpaste that I get on clearance. Pretty much anything but mint."
          },
          {
            "score": 1,
            "body": "Yeah but she prefers under it"
          },
          {
            "score": 1,
            "body": "I wasn’t surprised when he won just disappointed. His cult is huge and doesn’t stray far from his views where as fence riders are more likely to pick a candidate they thing will win regardless on if they follow the same views"
          },
          {
            "score": 1,
            "body": "Pretty much. I wear baggier shirts and most my pants have elastic waists. Only reason I needed maternity pants with my first is cause the uniform shirt for that job started riding up and showing my belly, so I wore the pants to have that belly band"
          },
          {
            "score": 2,
            "body": "The biggest obstacle for you is getting to the hospital when it’s time. Talk to your ob about this because they may have options for you getting there"
          },
          {
            "score": 1,
            "body": "I have always been a terrible sleeper and have been labeled a night owl. Both my kids (4yrs, 4months) go to bed at 7pm and wake at 7am. Pretty much I just nap when I can or knock out as soon as I’m able to"
          },
          {
            "score": 2,
            "body": "I originally quit nicotine because I knew I wanted another kid but the point where I decided to never go back was during withdrawal. I had a complete mental break down and during it I had attempted to find my grandparents gun to take everyone out with me. I didn’t find it and restarted therapy"
          },
          {
            "score": 1,
            "body": "We were meant to send our eldest to preschool this year but I think he’s gonna miss out because we just can’t get him fully potty trained and the cut off date is already here. Glad to hear that your little one is handling it well so far and hoping the universe gives me that same thing 😂"
          },
          {
            "score": 1,
            "body": "Fucking murdering a bunch of fuckheads who shot at me first and attracting freaks"
          }
        ]
      },
      {
        "score": 6,
        "body": "Begging the question fallacy. The word design implies a designer which has not been proven.\nSame sex attraction is still a matter of biology.",
        "author": "Yuck_Few",
        "author_hot_comments": [
          {
            "score": 8,
            "body": "Maybe you're just illiterate"
          },
          {
            "score": 13,
            "body": "Slipknot just comes across as pretentious in my opinion and Corey Taylor's lyrics sound like I'm 14 and this is deep"
          },
          {
            "score": 2,
            "body": "🤡"
          },
          {
            "score": 5,
            "body": "I'm not an attorney or anything but I figure saying you want to do something and stating that you are going to do it or not the same thing"
          },
          {
            "score": 2,
            "body": "I was doing some fanfiction in which Walter fires Jesse and hires todd. \nThe story takes so much darker turn"
          },
          {
            "score": 1,
            "body": "A wobble like that usually means your wheel is warped"
          },
          {
            "score": 1,
            "body": "I was literally about to comment the same thing"
          },
          {
            "score": 2,
            "body": "Try to keep up here. You said threatening to kill someone is a crime and I said I don't know 100% certain, as I am not an attorney but I'm pretty sure saying you want to do something and threatening to do it or not the same thing"
          },
          {
            "score": 1,
            "body": "Number of kids*"
          },
          {
            "score": 1,
            "body": "Are you incapable of reading your own replies? \nYou're the one who brought up threatening to kill someone."
          }
        ]
      },
      {
        "score": 6,
        "body": "Nothing homophobic at all about simple and basic biology and human reproduction...and also while not hating on people who prefer things other than that",
        "author": "OctoWings13",
        "author_hot_comments": [
          {
            "score": 2541,
            "body": "Some deadshots in the crowd...damn"
          },
          {
            "score": 55,
            "body": "CTV is a far left extremist nutjob cesspit"
          },
          {
            "score": 24,
            "body": "Why do people absolutely hate the police? Exhibit A right here...charging the fucking objectively 100% victim\n\nA piece of shit lifelong criminal, currently wanted by police, breaks into a home in the middle of the night, with a weapon\n\nThreat level is GREVIOUS BODILY HARM/DEATH\n\nThis means a \"proportional\" response is anything and everything to save your and your families lives\n\nThe criminal is lucky to be alive in this case, and the victim is 100% justified if he killed him"
          },
          {
            "score": 8,
            "body": "\"Terrorist values are Canadian values\"\n\n - mark carney"
          },
          {
            "score": 5,
            "body": "Been ripping on Ford for quite a while, but he's 100% right here and has my full support about what he said about defending yourself, your home, crime, criminals, liberal judges, and bail here"
          },
          {
            "score": 6,
            "body": "The article says the police are the ones who decided to lay charges. The police could have chosen NOT to charge the FUCKING VICTIM...the victim of the criminal the were looking for no less while he was mid another crime with a weapon threatening grevious bodily harm/death to the victim and his family\n\nAccording to the article, it is, in fact, absolutely up to the police"
          },
          {
            "score": 15,
            "body": "No.\n\nYou can switch how you act and dress, in this case put on a dress, makeup, and act feminine, but you're still a dude, with a dick\n\nDudes that are into dudes are gay...even if the dick and balls they like are swinging below a skirt\n\nIdk why we tried to complicate everything so much\n\nNothing wrong with just being a gay dude and liking dick"
          },
          {
            "score": 3,
            "body": "\"Terrorist values are Canadian values\"\n\n - mark carney"
          },
          {
            "score": 2,
            "body": "This is what happens when you have WAY too many people for your systems to support\n\nLiberal mass immigration is killing Canada and Canadians"
          },
          {
            "score": 3,
            "body": "The article says the police are the ones who decided to lay charges. The police could have chosen NOT to charge the FUCKING VICTIM...the victim of the criminal the were looking for no less while he was mid another crime with a weapon threatening grevious bodily harm/death to the victim and his family\n\nAccording to the article, it is, in fact, absolutely up to the police"
          }
        ]
      },
      {
        "score": 5,
        "body": "We aren’t anatomically or biologically designed to do anything at all. We aren’t designed. Heterosexual PIV is what results in sexual reproduction but there’s also all kinds of other sex stuff we can do.",
        "author": "___AirBuddDwyer___",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "The point is that you’re trying to solve crime by hitting criminals harder, with a bigger stick. And that won’t work because “criminals aren’t being hit with big enough sticks” isn’t what causes crime. \n\nWe’re not going to live in a utopia, but if you wanna better society by reducing crime then you’ve got to understand what causes crime and address that."
          },
          {
            "score": 40,
            "body": "I doubt it’s supposed to be translated, it’s just supposed to look like some Daedric letters for a spell"
          },
          {
            "score": 1,
            "body": "We generally didn’t buy the land from the people living on it, you silly goose"
          },
          {
            "score": 1,
            "body": "You should apply the same skepticism to whoever told you immigrants are the problem\n\nI don’t see that mass immigration has necessarily been pushed on us. I think fear about immigrants is overblown."
          },
          {
            "score": 1,
            "body": "Sounds kind of Orwellian"
          },
          {
            "score": 2,
            "body": "Well, that’s rhetorical solution isn’t it? We didn’t deport half the population for being racist, we made it illegal to discriminate based on race."
          },
          {
            "score": 2,
            "body": "Doesn’t make a lick of sense while we have FPTP. There are certainly to separate and opposed blocs within the Democratic Party, but splitting them wouldn’t benefit either of them unless one garnered huge support fork independents which I don’t think is likely enough for the risk."
          },
          {
            "score": 1,
            "body": "The availability of guns seems like a systemic factor to me."
          },
          {
            "score": 1,
            "body": "Where, PragerU?"
          },
          {
            "score": 1,
            "body": "I think social pressure is actually a good part of our society. It can malfunction, but if lots of people believe something and you don’t, that’s cause to reconsider. And because it needs lots of people to make it work, it’ll generally favor ideas that are widely beneficial."
          }
        ]
      }
    ]
  },
  {
    "title": "It’s okay for a white person to choose not to date a black person solely because they are black",
    "content": "It’s well known that there are cultures or people that choose to date/marry people exclusively within their culture, whether to preserve that culture within their family or because their culture/religion says they should. I’m all for this, a couple of examples are that I’ve spoken to muslims who have explained that within Islam they cannot marry ‘outsiders’, or I’ve had friends from places like Africa who have said they will only date people who are also black and from Africa as this helps maintain that sense of their home culture when starting a family. \n\nHowever, if a white person says they won’t date a black person this is often seen as racist. I believe that the only time this is racist is if you refuse to date black people on the basis of a negative stereotype that you attach to black people. On the other hand, if you only want to date other white people because that’s your preference and you want to have a white family with people who have more in common with yourself- I believe this is absolutely fine and this choice should not open you up to criticism. It’s okay to not date someone on the basis of their skin colour, that goes both ways. ",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1muhw35/its_okay_for_a_white_person_to_choose_not_to_date/",
    "score": 242,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1muhw35",
    "bertscore_f1": 0.5190796256065369,
    "bertscore_precision": 0.5191527605056763,
    "bertscore_recall": 0.5190065503120422,
    "top_level_comments": [
      {
        "score": 78,
        "body": "This is an  \" unpopular true opinion\" .... i dont represent ALL blk individuals but i can safely say. WE GET IN WHERE WE FIT IN. \n\nIf we meet someone who is COINCIDENTALLY another race and we hit it off? We go with it. We dont go out of our way to TARGET this or that race 😅. \n\nDate whomever you want and theres nothing wrong with a wht person professing \"I DONT DATE BLK PEOPLE\" . Perhaps, they feel its too far off their own physical appearance to create children. \n\nMaybe they feel the cultural implications of it being \" polarizing\" in public. Maybe they find barely any of us attractive? Its all good 😅.... its not rocket science.",
        "author": "Dear-Relationship666",
        "author_hot_comments": [
          {
            "score": 1,
            "body": " Here's the thing ( in my opinion/observation/as a native) a lot of the middle class out here are 42+. They got in the job/housing market when it was obtainable and their wages kept just enough of a pace. \n\nA lot of \" old money\" parents/ grandparents who were lower middle but as time progressed their 17k home ( in my grandma case) is now worth 800k. \n\nSo, they have heirs who inherited those properties.... you'll find large swathes of the middle class in various cities. Their homes were built in the 1920s- early 2000s mostly."
          },
          {
            "score": 0,
            "body": "I dont feel guilty for one minute.... the luck if tje draw and destiny put me in America.  Its a cold world. Convenience and creature comforts doesnt mean you dont face tragedy, obstacles etc"
          },
          {
            "score": 0,
            "body": "Time to LET HIM GO"
          },
          {
            "score": 1,
            "body": "No 😅"
          },
          {
            "score": 34,
            "body": "Still cute.... never were a ugly duckling.... more of a past v present post"
          },
          {
            "score": 1,
            "body": "Its interesting you said \" line up\" and i agree.... im only 6'1 200lbs. I find women 5'5- 5'8  120-160lbs are the most comfortable for me"
          },
          {
            "score": 1,
            "body": "Checking it out now at work 🤔"
          },
          {
            "score": 1,
            "body": "Statistically blk ppl been moving out since 1990.... we were around 20% in the late 70s. Then there was another brief migration 2000s"
          },
          {
            "score": 1,
            "body": "We need euthanasia in America! People should die under their own terms, painless and with dignity"
          },
          {
            "score": 1,
            "body": "I instantly noticed these books lol"
          }
        ]
      },
      {
        "score": 76,
        "body": "Many people do not date out of their race",
        "author": "Fit-Duty-6810",
        "author_hot_comments": [
          {
            "score": 18,
            "body": "Honestly this sounds like a start of a beautiful relationship\n\nEdit: ignore my positive comment, it’s an OF girl…"
          },
          {
            "score": 1,
            "body": "Check the sub waiting to get wed"
          },
          {
            "score": 4,
            "body": "Heck no"
          },
          {
            "score": 75,
            "body": "Many people do not date out of their race"
          },
          {
            "score": 15,
            "body": "Zdravo, jas sum Dime. Sakav da prasham SHO PRAJME ZA KLECANJE??"
          },
          {
            "score": 6,
            "body": "r/shoprajmezaklecanje ahahhahahhahah zakon!!!"
          },
          {
            "score": 4,
            "body": "Your partner is wrong for setting an ultimatum like this… this is not an ideal family"
          },
          {
            "score": 7,
            "body": "My theory is it is usually a lie. If you stink, or have a bad breath or you are ugly and if I reject you I will say “you are not my type”, or “I’m seeing someone”. So I see no point asking. Got rejected? Take it as a champ and walk away."
          },
          {
            "score": 3,
            "body": "Mashinka brat mi, ili zhenski brich so 7 sechila(ne se zezam). I mesto pena za bricenje kupisi gel za brichenje."
          },
          {
            "score": 139,
            "body": "“But why did you reject me??” Do you think it sounds good?"
          }
        ]
      },
      {
        "score": 74,
        "body": "It's ok for anyone not to date anyone for any reason. Just be polite.",
        "author": "Electrical_Diver_321",
        "author_hot_comments": [
          {
            "score": 75,
            "body": "It's ok for anyone not to date anyone for any reason. Just be polite."
          },
          {
            "score": 6,
            "body": "Now do hetero and homosexuality"
          },
          {
            "score": 1,
            "body": "They predominantly don't support a 2SS. At least you are being consistent. I also wonder if a 2SS would actually be the end of Israel's aggression but there we go..."
          },
          {
            "score": 1,
            "body": "> the calls for negotiation started\n\nThere were negotiations going on before the invasion. Macron visited Moscow personally to ask Putin not to start a war.\n\nThere is no easy way to deal with a bad actor like Putin. If you instantly give concessions, he learns that aggression is rewarded. \n\nI will ask again: do you think the Palestinians should have taken the same route? Should they offer to give up land for peace or do you want them to fight to the death?"
          },
          {
            "score": 1,
            "body": "And there it is right on cue. \n\nIt's held on to far more land than anyone expected it to. What do you think they would have negotiated away when people thought Kiev would fall in a week?\n\nIncidentally, do you think the Palestinians should have taken the same route?"
          },
          {
            "score": 2,
            "body": "Anyone still on his side after the Epstein fiasco is just cattle-class at this point"
          },
          {
            "score": 1,
            "body": "Small margins. Stores make money by selling in bulk. When you steal you make losses for these stores\n\nBut don't worry draconian laws are on the way. You have only yourselves to blame"
          },
          {
            "score": 0,
            "body": "America will not exist by 2028"
          },
          {
            "score": 1,
            "body": "Yes, there is a large chunk who are not going to be convinced of anything contrary to their current beliefs."
          },
          {
            "score": 1,
            "body": "I recognised him as the bad guy from Se7en.\n\nHe said I was too young to have seen that movie."
          }
        ]
      },
      {
        "score": 38,
        "body": "By the same token, gay men are not sexist. I draw the line at not putting people down. Other than that it's just personal preference which I can't judge you.",
        "author": "LittleBeastXL",
        "author_hot_comments": [
          {
            "score": 35,
            "body": "It's another indication of corruption when the 3 Malfoys escape punishment"
          },
          {
            "score": 1,
            "body": "I would like one. Just not sure if it will be deemed profitable enough for developers."
          },
          {
            "score": 38,
            "body": "By the same token, gay men are not sexist. I draw the line at not putting people down. Other than that it's just personal preference which I can't judge you."
          },
          {
            "score": 0,
            "body": "Need to whitewash the greens a little bit by introducing some evil on the blacks."
          },
          {
            "score": 8,
            "body": "And Olajuwon had to beat both in 1995"
          },
          {
            "score": 7,
            "body": "And worried that the theft alarm would ring"
          },
          {
            "score": 7,
            "body": "Yes. Hence players taking pay cut isn't going to lead to lower price. It only leads to more profit for owners."
          },
          {
            "score": 5,
            "body": "I'd rather the players get paid more than the billionaire owners keeping larger share of revenue"
          },
          {
            "score": 1,
            "body": "I'll never respect a military leader who burns his daughter, then tries to siege a castle containing an army that easily defeats his army in an open field."
          },
          {
            "score": 1,
            "body": "There won't be as long as Real Madrid (and to less extent Barcelona) are still seen as a prestige by top players"
          }
        ]
      },
      {
        "score": 36,
        "body": "Anyone can be attracted to any type they want to be attracted to.",
        "author": "SystematicHydromatic",
        "author_hot_comments": []
      },
      {
        "score": 21,
        "body": "That's not unpopular at all. An individual can date or not date whoever they want for whatever reason.",
        "author": "Ash_fckn_Ketchum",
        "author_hot_comments": [
          {
            "score": 3,
            "body": "I'm usually not big on error cards, but damn, I think this one actually improves the card substantially. What a pull, big congrats."
          },
          {
            "score": 9,
            "body": "Bin erstaunt über die Menge an EVA fans, find ich gut."
          },
          {
            "score": 3,
            "body": "Eine der gängigen Abkürzungen für den Anime \"Neon Genesis Evangelion\". Ziemlicher Meilenstein, aber inzwischen halt auch gut alt, deswegen hätt ich da nicht unbedingt mit gerechnet."
          },
          {
            "score": 0,
            "body": "I think you're taking OPs paraphrasing way too literally. Intelligence, mannerisms, looks, etc. are all influenced by genetics. Most people want children that resemble them in some way,  that doesn't make them shitty parents."
          },
          {
            "score": 21,
            "body": "That's not unpopular at all. An individual can date or not date whoever they want for whatever reason."
          },
          {
            "score": -4,
            "body": "I have to imagine very few people have kids JUST to have someone that resembles them and literally nothing else. But it's clearly a deciding factor. And given that 2% of families have adopted children, that degree of selfishness is obviously acceptable, if you can even call it that."
          },
          {
            "score": 58,
            "body": "NTA. People taking over the family business has always been a thing, nothing wrong with that."
          },
          {
            "score": 2,
            "body": "YTA. You seem to know that though."
          },
          {
            "score": 1,
            "body": "Peking in der Halderstr., den gibt's seit gut 30+ Jahren, mittagsmenü hat immer Vorspeise, Hauptgericht und nen obsalat oder Kaffee hinterher für iwas zwischen 7-13 Euro, je nach Gericht."
          },
          {
            "score": 6,
            "body": "Oberhausen is something most people tend to avoid. Univiertel can be argued, I've been told theft can be an issue there. Some parts of Lechhausen are sketchy, there's a ton of brothels there but also a decent chunk of newly built apartment buildings. You'll quickly grasp the idea of what to avoid anyway once you come and check the flats out. Oberhausen is just notorious for drug addicts in plain daylight."
          }
        ]
      },
      {
        "score": 18,
        "body": "Huh interesting, when it comes to not wanting to date someone based on race (particularly black people), this sub is totally on board\n\nbut when it comes to women expressing not wanting to date men with certain features like height, this sub complains saying women should give those men a chance, that they’re being shallow, and that they should date them anyway knowing the women would be unhappy. \n\nWhy the double standard? Should people date who they’re not attracted to? ",
        "author": "Heujei628",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Yeah that’s not a reward…that’s the bare minimum lmao \n\nThe bar is truly in hell."
          },
          {
            "score": 1,
            "body": "The men in these comments are doing a great job of making marriage sound awful for women. No wonder birth rates are falling. "
          },
          {
            "score": 1,
            "body": "Why not just get plastic surgery? The amount of money spent on traveling and escorts could be used as a one time investment to acquire a more aesthetic face then you could have easier time dating for the rest of your life. Even Hollywood men and male models get plastic surgery. \n\nI’m biased because I’m a woman and see other women get surgery to fix their perceived flaws and then the rest of their life is a breeze so I’m curious why more men don’t take the easy route.  "
          },
          {
            "score": 6,
            "body": "The main point of my comment was to highlight the general hypocritical behavior of the users on this sub when it comes to rejecting someone based on an immutable characteristic. \n\nRejecting based on race (especially if that race is Black)? The general response is primarily positive: “Totally ok!”  \n\nRejecting based on height? The general response is primarily negative: “women’s standards are too high”, “they’re being shallow”, “lower your standards”, “women need to give those men a chance”, “women should learn to settle”, “women are delusional”, whine, whine, whine. There’s a lot more shaming, whining, snd critical comments compared to the former sentiment.\n\nIt’s interesting seeing how replacing race with height suddenly makes having dating preferences problematic for the users in this sub lol."
          },
          {
            "score": 18,
            "body": "Huh interesting, when it comes to not wanting to date someone based on race (particularly black people), this sub is totally on board\n\nbut when it comes to women expressing not wanting to date men with certain features like height, this sub complains saying women should give those men a chance, that they’re being shallow, and that they should date them anyway knowing the women would be unhappy. \n\nWhy the double standard? Should people date who they’re not attracted to? "
          },
          {
            "score": 5,
            "body": "> They're quick to dismiss things like more police on the streets to fight crime, but they never seem to offer a tangible plan.\n\nWell obviously you haven’t been paying attention or bothered to do any research. That’s what the whole “defund the police” movement was: re-allocate funds and responsibilities to social services. This would make the police force MORE efficient to be PURELY focused on crime and not be called for every little thing. Having social services deal with non-crime issues including implementing preventative measures would reduce the overall rate of civil issues. "
          },
          {
            "score": 3,
            "body": "From what I’ve seen, people who tend to loudly exclude other groups from their preferences do so because they got rejected by that group too much.\nI’m just going to assume most of the people putting down other groups are butthurt because they got told “no”. \n\nAlso when it comes to people professing who they won’t date it’s \nalmost ALWAYS black people with them. I don’t know why they’re so obsessed with us. They don’t do this at this level to any other race "
          },
          {
            "score": 0,
            "body": "> That doesn't automatically make the assumption the verified intent of any person who simply wants the platform.\n\nDuh I never said. I was arguing against the idea that’s it’s disingenuous "
          },
          {
            "score": -7,
            "body": "How is it disingenuous when that’s what exactly happens? Voat, Gab, Rumble, the “new” Donald Trump Reddit site, etc. the human rejects on those sites immediately turn those places into cesspools of racism, sexism, homophobia etc. because us minorities existing is apparently a huge problem for them "
          },
          {
            "score": 12,
            "body": "> There was absolutely a force and a large force trying to remove the police force entirely.\n\nCrazy how in 2025 people like you still somehow believe this. No one was pushing to remove the police entirely. They were pushing to re-allocate funds to social services so that the police don’t have to respond to every little thing. \n\nDefund the police was literally designed to make the police MORE efficient by shrinking their focus/responsibilities to be **purely** focused on crime and allocating non-crime issues to departments that are actually properly equipped to deal with those situations. \n\nYou have no clue what you’re talking about. "
          }
        ]
      },
      {
        "score": 15,
        "body": "As long as you’re not saying “I don’t date black people because they’re subhuman” I don’t see any issue with it. Like that is definitely racist but if you’re not attracted to people for whatever reason regarding looks or personality, I don’t think race really matters lol",
        "author": "SquashDue502",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Before slavery took off in the U.S. there was indentured servitude. A lot of the south relied on slavery for their agricultural based economy, but a better statement is that America was built on the backs of immigrants (to include slaves). The transcontinental railway was built largely by Chinese immigrants, Erie Canal by Irish immigrants.  A lot of manufacturing in the northeast was done by German Italian and Eastern European immigrants. \n\nImmigrants played such a large role because most people before the 1900s were from “somewhere else”. Before 1900, the U.S. was smaller population than most of the colonial powers, and pretty empty, so the folks here at the time either were born to the few already here, or much more likely immigrated"
          },
          {
            "score": 1,
            "body": "Trumps executive order, and all executive orders for that matter, are legally binding orders issued by the president to manage operations of the federal government.\n\nDeclaring English the official language of the U.S.  through use of executive order means he actually told all federal branches of government that their official language is now English. Not daily use in the country, or state level, or for anyone doing anything outside of the federal government.\n\nIt’s a great example of how little this moron understands of how our democracy works. To make English the official language of the country for public instruction, daily life, etc. it has to be introduced as a bill to Congress to be passed. He can totally sign off on it, but he can’t just declare that shit without review of Congress lmao"
          },
          {
            "score": 1,
            "body": "Technically American alligator range extends into NC. But copperheads are def scary enough so I’m fine with it lol"
          },
          {
            "score": 1,
            "body": "15 is not Latin specific it’s an Arabic numeral which is understood in most modern societies, even if someone speaks a language that has its own set of numerals. Hindi speakers in India usually learn both, and English, so regardless would understand 15."
          },
          {
            "score": 1,
            "body": "For the federal government and its employees. Executive orders are directives from the president on how to manage the federal government. The president can’t declare an official nationwide language outside of that scope unless Congress passes a bill saying so."
          },
          {
            "score": 1,
            "body": "Guaranteed they actually can tho they just choose not to 😂"
          },
          {
            "score": 1,
            "body": "It is Spanish in Miami and many parts of southern Texas 🤷🏻"
          },
          {
            "score": 1,
            "body": "Most road signs are symbols combined with words so they can be understood by illiterate people and foreign language speakers"
          },
          {
            "score": 1,
            "body": "If your doordash order was messed up, contact customer service? Why are you trying to communicate by spoken word to the driver lmao\n\nAll my problems have always been resolved by using the apps proper channels to report messed up orders \n\nAs far as non-door dash stuff, Seeing as there’s no official language, it’s not *required* to know English, but I agree it’s probably in their best interest. That said, it’s not the law so you should probably get used to people not speaking English in the United States. A quarter of the population speaks Spanish at home. \n\nWhen I moved to Miami I could have bitched and complained that everyone there used Spanish first and had broken English, but instead I just learned a few basic phrases in Spanish and my life was fine. And if you seriously can’t communicate “where is my drink” with universal hand signals, then perhaps the communication barrier is you 😂"
          },
          {
            "score": 16,
            "body": "As long as you’re not saying “I don’t date black people because they’re subhuman” I don’t see any issue with it. Like that is definitely racist but if you’re not attracted to people for whatever reason regarding looks or personality, I don’t think race really matters lol"
          }
        ]
      },
      {
        "score": 12,
        "body": "Its not racist to silently make that choice but its weird af to blatantly announce it to everyone and extensively defend it in a reddit post",
        "author": "KeyEntityDomino",
        "author_hot_comments": [
          {
            "score": 2,
            "body": "Wild cards shouldn't be blocked by suit-debuffing bosses"
          },
          {
            "score": 5,
            "body": "The flow and beat selection is better across Conway projects imo"
          },
          {
            "score": 1,
            "body": "I mean fear season 5 exists tho"
          },
          {
            "score": 13,
            "body": "Its not racist to silently make that choice but its weird af to blatantly announce it to everyone and extensively defend it in a reddit post"
          },
          {
            "score": 6,
            "body": "Its bizarre he even has to comment on this tbh, god forbid parents do parenting or venues do venue-ing"
          },
          {
            "score": 1,
            "body": "How does having a language barrier make you LESS socially anxious? You just dont have to bother speaking to anybody? Lmao"
          },
          {
            "score": 1,
            "body": "honestly better than I expected. This has me thinking its gonna have I Am Abomination vibes"
          },
          {
            "score": 21,
            "body": "She gave zero fucks and that tilted her so much lmao"
          },
          {
            "score": 3,
            "body": "I hope he joins up full time, guy fuckin shreds"
          },
          {
            "score": 3,
            "body": "I enjoyed his more chill mini-reviews on the AJ channel, cool guy"
          }
        ]
      },
      {
        "score": 11,
        "body": ">It’s okay for a white person to choose not to date a black person solely because they are black\n\nI don't have a hard take on whether race based dating preferences are inherently wrong, but I do have a hard take that if black people get to avoid dating whites, whites get to avoid dating black people.",
        "author": "AgentOfCUI",
        "author_hot_comments": []
      }
    ]
  },
  {
    "title": "Romantic Relationships are Fundamentally Superficial and Lack Substance.",
    "content": "Hear me out. \n\nI believe that true love is unconditional. However with sexual and romantic love, I have seen that it is anything but unconditional. Tyler Zeigel after his face was radically altered due to injury lost his partner. Initially, she tried to make it work (even showing up on Oprah's show bragging about how great she is) but she ended up dumping him. Tyler later died from drug overdose. There are other cases of this too, like acid attack victims and relationship breakups due to weight gain. Personally I would have stayed with my partner through thick and thin, but then again I am not interested in relationships nor will I go out of my way. \n\nSex and lust seem to be a fundamental aspect of romantic relationships. After all if you do not desire their body it wouldn't be a romantic love but a platonic love. \n\nI argue that platonic love is true love, since you genuinely care for the person without expecting ANYTHING in return. You enjoy being with that person and they feel the same way about you. Parents, BFFs, and relatives often have platonic love for you, and it feels amazing. Knowing that you are loved and cared for is sufficient to satisfy the need of belonging in society. \n\nPlatonic love and romantic love are not mutually exclusive. I think all successful marriages have a combination of romantic and platonic love. However, with the current dating expectations, it seems as though people are becoming more and more superficial as the two sexes are becoming independent from each other. Gender roles are breaking down. \n\nI can never understand why people want to love a stranger based on mutual attraction and lust. I would never trust a stranger in this regards, and am frankly shocked this is common practice. It sounds crazy to me that a man like me can suddenly fall in love with a stranger and trust her with his life, and vice versa. Like seriously what do they bring to the table that is worth risking sexual intimacy with them?\n\nIf there is substance to romantic relationships I'd like to see it, because so far I haven't seen anything of worth. Are people dating to mooch off their potential spouse? Are people dating in hopes of casual coitus? Are people dating out of boredom? Are people dating out of custom? Are people dating because of some sort of punishment if they do not date? If you are in a relationship please explain this. \n\nTLDR: I don't see any value or potential in dating due to the superficial and lustful nature of romantic love. However, I fully support platonic love and focus on the happiness of yourself and loved ones. ",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1muayvx/romantic_relationships_are_fundamentally/",
    "score": 0,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1muayvx",
    "bertscore_f1": 0.5190623998641968,
    "bertscore_precision": 0.4999905526638031,
    "bertscore_recall": 0.5396469831466675,
    "top_level_comments": [
      {
        "score": 1,
        "body": ">I think all successful marriages have a combination of romantic and platonic love.\n\nI absolutely agree. I don't believe in unconditional love as you do (maybe only from a mother), but it's silly to build long-term relationships and marriage based on only romantic infatuation. Functional relationships need so much more than that to thrive, you need camaraderie and commitment more than anything else, especially because romantic passion almost always fade with time.   \n  \nI don't disavow all relationships for that, because I've found exactly what I want with my current one. We care for each other deeply as human beings, want to see each other happy and actually put in work to make that a reality. You don't need to pursue dating per se, but I'd say keep your mind open, maybe someone will show up that you can build this special relationship with.",
        "author": "choimari",
        "author_hot_comments": []
      }
    ]
  },
  {
    "title": "Telegony? your thought? any suggestion",
    "content": "Telegony?  \nThe belief that a woman's previous sexual partners can influence the genetic makeup of her future children is known as telegony. This theory suggests that traits from a woman's former mates could be inherited by offspring conceived with different partners. Historically, telegony was accepted in various cultures, including ancient Greece, where it was believed that offspring could inherit characteristics from a mother's previous mates. (en.wikipedia.org)\n\nHowever, modern genetics has thoroughly debunked this concept. Scientific research has demonstrated that a child's genetic material is exclusively derived from the DNA of their biological parents—the mother and the father who contribute the egg and sperm, respectively. There is no mechanism by which the genetic material of a woman's previous partners can influence the DNA of her future offspring. (hiro-clinic.or.jp)\n\nIn summary, the idea that a woman's past sexual partners can affect the genetics of her future children is a myth. Modern scientific understanding confirms that offspring inherit genetic material solely from their biological parents, without any influence from previous mates.",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1muers0/telegony_your_thought_any_suggestion/",
    "score": 0,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1muers0",
    "bertscore_f1": 0.5101430416107178,
    "bertscore_precision": 0.5029369592666626,
    "bertscore_recall": 0.5175586938858032,
    "top_level_comments": [
      {
        "score": 9,
        "body": "You didn't need to bring your conversation with ChatGPT here. It could have just stayed there.",
        "author": "stevejuliet",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Who the fuck thinks Trump \"accidentally\" became president?\n\nI mean, aside from Trump and his first term team, who were fucking *shocked* to win and had absolutely no plan in place and had to scramble to write a victory speech and hire staff!"
          },
          {
            "score": 7,
            "body": "This trivialize every other method. I don't even need to stop whatever else I'm doing. If I'm low on units, I just pop a donut and scan a few fauna as I play."
          },
          {
            "score": 8,
            "body": "Wow...this is trash.\n\nAnd not necessarily because it's AI. It's just trash."
          },
          {
            "score": 1,
            "body": "Fucking leopards, my man."
          },
          {
            "score": 1,
            "body": ">MSNBC\n\nI gave you NBC, not MSNBC. There is a significant difference.\n\nEither way, though, the article is purely factual.\n\n>the article itself doesn't say much.\n\nThe article points out how multiple authors of specific chapters of Project 2025 are now leading the exact sectors of the government they criticized. They were selected by Trump.\n\n>You immediately take this condescending approach\n\nYes, because you are making absurdly false claims while claiming you are being logical. Project 2025 wasn't \"a lie.\" Its authors are currently *running significant areas of the government*. That's not debatable. That's a fact.  You aren't being logical. You are simply incorrect."
          },
          {
            "score": 3,
            "body": "In a strictly pedantic scenario, sure, it's *grammatically* sound. However, it clearly isn't a good faith interpretation of those abilities. You're looking for a loophole, but what you are attempting to accomplish isn't in the spirit of *either* of those classes."
          },
          {
            "score": 1,
            "body": ">Project 2025 was a lie. didn't find any proof it it.\n\n[Holy shit.](https://www.nbcnews.com/politics/trump-administration/key-project-2025-authors-now-staffing-trump-administration-rcna195107) For someone who claims to be \"logical,\" you have no clue what's going on."
          },
          {
            "score": 9,
            "body": "The Establishment Clause of the First Amendment forbids Congress from passing laws that respect an establishment of religion."
          },
          {
            "score": 2,
            "body": "It's not the public schools doing this. It was the Texas legislators. Don't blame the teachers."
          },
          {
            "score": 1,
            "body": "Okay. I'll rephrase it:\n\nI'm going to need you to explain how the \"mass die off of shrimp\" **could be** attributed to leftism."
          }
        ]
      },
      {
        "score": 7,
        "body": "> However, modern genetics has thoroughly debunked this concept.\n\nSo…where’s the confusion?",
        "author": "Frewdy1",
        "author_hot_comments": [
          {
            "score": 5,
            "body": "Yup and I’ve been banned from conservative subs for saying conservative things. And conspiracy subs for asking questions! Reddit mods are corrupt af"
          },
          {
            "score": 323,
            "body": "Don’t forget how staying an extra half hour is the expectation, but 2 minutes late is grounds for immediate termination. "
          },
          {
            "score": 16,
            "body": "A lot of clever selected editing on the podcaster’s part. A lot of grifters want us to believe space is fake because it takes little to no effort on their part to get paid to say it. We ca obviously see things like nebulae, the Moon, the ISS with our own eyes, so saying they’re fake is only done to profit off the dumb. "
          },
          {
            "score": 2,
            "body": "Yes he’s always said several times he’s wanted to. Weird how the 2nd Amendment people and the NRA aren’t up in arms against him. "
          },
          {
            "score": 2,
            "body": "Yup called a few out on here. "
          },
          {
            "score": 2,
            "body": "https://www.project2025.observer/en\n\nYou were saying? ;)"
          },
          {
            "score": 1,
            "body": "“There is no war in Ba Sing Se.”"
          },
          {
            "score": 5,
            "body": "Lot of bots downvoting and trying to hide this one! Good find!\n\nRelease the Epstein files!"
          },
          {
            "score": 1,
            "body": "I’m sure you’re programmed to believe that. \n\n“The Party told you to reject the evidence of your eyes and ears. It was their final, most essential command.”"
          },
          {
            "score": 1,
            "body": "Is this someone famous? OOTL"
          }
        ]
      },
      {
        "score": 6,
        "body": "So whats your opinion?",
        "author": "GustaQL",
        "author_hot_comments": [
          {
            "score": 7,
            "body": "So whats your opinion?"
          },
          {
            "score": 2,
            "body": "Obrigado!"
          },
          {
            "score": 2,
            "body": "So it seems your gf has a kink similar cnc. Just make a safe word that actually means no. That way as long as she doesnt say that word you know that she actually wants it. But I think you should have a proper conversation about it and ask exactly if that is what she wants"
          },
          {
            "score": 0,
            "body": "Yes I know what you are saying. However, that is a small market cap or why people but gold. You can say that people buy bitcoin because they dont trust banks aswell, not just because they are speculating. Also people buy bitcoin because of inflation"
          },
          {
            "score": 0,
            "body": ">People buy jewelry and gold decorations they pay a lot of money for them, whether you think it's smart or not.\n\nYou can switch this with bitcoin aswell"
          },
          {
            "score": 1,
            "body": "Ah yes jewlery, very usefull for you know... looking good"
          },
          {
            "score": 1,
            "body": "Uma questao. Os depositos a prazo para novos clientes, significa que so tenho direito a usufruir do DP 1 vez?"
          },
          {
            "score": 1,
            "body": "Bitcoin has as much value as gold (except for wire manufacturing, but alas, that is not why gold is valuable)"
          },
          {
            "score": 1,
            "body": "Nao têm limites de valores? Tinha ideia que andavam no maximo nos 10k ou 20k"
          },
          {
            "score": 1,
            "body": "Para sp500, 5 anos pode ser pouco. Tens certificados de aforro que pagam ligeiramente melhor que os DP, mas nao vai ser algo assim tao melhor. Podes arriscar em ftse tbm, mas os riscos acabam por ser semelhantes ao sp500. Se nao te importares de ter de esperar mais do que 5 anos é bom"
          }
        ]
      },
      {
        "score": 6,
        "body": "It's basically an old attempt to explain why some kids tend to look like woman's ex instead of current husband.\n\nIn reality this happens >!because she cheats on the current guy with her ex!<",
        "author": "Tokimonatakanimekat",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "As long as working exists, there is always going to be people getting trafficked and force fed drugs and whatnot to force them to comply. Your disgusting economy will always create a demand and they're all too willing to meet it."
          },
          {
            "score": 1,
            "body": "Yes. Being NT with median IQ would be best for maximizing subjective happiness."
          },
          {
            "score": 1,
            "body": "I am not arguing that Ukraine should or should not surrender, just clarifying some facts about the conflict."
          },
          {
            "score": 3,
            "body": "Does it work for romance as well?"
          },
          {
            "score": 1,
            "body": "You ain't helping comparing records to average "
          },
          {
            "score": 1,
            "body": "If sex isn't a need than quality of life that's any higher than basic sustenance isn't a need either, yet people aren't reprimanded for aspiring more.\n\n\n> being horny is a good enough reason to by a body of another human being, then maybe their appearance isn't the main issue\n\n\nWith this logic everyone who pays another human being to do any task for the buyer is doing the same."
          },
          {
            "score": 1,
            "body": "Who? Escorts?"
          },
          {
            "score": 1,
            "body": "Few exceptional women who could physically perform as well as average male in their fields doesn't change the fact that giving normal everyday women an idea that they can easily best a male in direct physical confrontation is detrimental for their health.\n\n\nEspecially in the current era cus some men embraced the idea of gender equality unironically and will absolutely punch an aggressive woman back as they would've punched a dude."
          },
          {
            "score": 2,
            "body": "The fact is that this already happened with you and other guys, so there are clearly no hard moral blocks against ghosting in her mind, so she may ghost someone the moment she *feels* they aren't worthy."
          },
          {
            "score": 1,
            "body": "I misunderstood your post then."
          }
        ]
      },
      {
        "score": 6,
        "body": "Modern genetics thoroughly debunked theres your answer",
        "author": "Razkinzmangowurzel",
        "author_hot_comments": [
          {
            "score": 10,
            "body": "Bot"
          },
          {
            "score": 8,
            "body": "Porn of women that looked illegally young and some probably unfortunately were"
          },
          {
            "score": 4,
            "body": "I think it was maybe a combination of both? Im too young to have ever seen it (not that i would want to) but thats just what i thought jailbait meant. Could be wrong"
          },
          {
            "score": 3,
            "body": "Its no where near as toxic or sexist as male incel stuff"
          },
          {
            "score": 1,
            "body": "u/bot-sleuth-bot"
          },
          {
            "score": 1,
            "body": "Like idiots who think trump isn’t a pedo"
          },
          {
            "score": 3,
            "body": "My bedroom door is 5’7. Ive run in before and utterly thwacked my head. Its a miracle i wasnt concussed"
          },
          {
            "score": 5,
            "body": "Modern genetics thoroughly debunked theres your answer"
          },
          {
            "score": 1,
            "body": "Date at any age is best. I had my first “girlfriend” when i was like 4/5 and dated quite a few times since then. As long as you date within your age group/class at school"
          },
          {
            "score": 1,
            "body": "Fuck reform! Yes!"
          }
        ]
      },
      {
        "score": 4,
        "body": "Holy shit, gen z is going to doom us all...",
        "author": "Caudillo_Sven",
        "author_hot_comments": []
      },
      {
        "score": 4,
        "body": "Your own post proves you wrong",
        "author": "MicroscopicGrenade",
        "author_hot_comments": [
          {
            "score": 16,
            "body": "20-30 year old Asian or Latina, overweight, sedentary lifestyle, short, office job or creative job like marketing"
          },
          {
            "score": 4,
            "body": "Ah, great"
          },
          {
            "score": 5,
            "body": "Average ass knees"
          },
          {
            "score": 3,
            "body": "Someone told me that I sound like the kind of guy that would attack a woman in the forest in the being alone with a random man vs. a random bear scenario\n\nI think that the insult was that I sound like the kind of guy who'd violently attack and/or rape a woman but it was never specified\n\nI have no idea why they said that"
          },
          {
            "score": 2,
            "body": "I wish they'd be open with their feelings and actually tell me what they're upset about\n\nIt's rare that you'll ever know what sets some people off as they're just, too lost to the madness by the time you see their message"
          },
          {
            "score": 2,
            "body": "Makes sense"
          },
          {
            "score": 1,
            "body": "I'm not even sure how many times I've been said to be anti-Semitic, pro genocide, pro rape, a Nazi, a Jew, a misogynist, American, MAGA, \"abuser\", etc."
          },
          {
            "score": 1,
            "body": "*sigh*\n\nSure.\n\nI wasn't referring to accidents like that, but, it's probably not going to make sense to you.\n\nIf you're still furious over your misinterpretation - your actions - I'll understand."
          },
          {
            "score": 1,
            "body": "\"The sun was in my eyes so I closed them for a second\""
          },
          {
            "score": 1,
            "body": "Criminal charges are likely more rare for this in Canada - it's often just a traffic offense to kill cyclists - and, probably because of the burden of proof required for criminal charges.\n\nA fine of say, $50 to $1,000 isn't unusual, but it of course varies.\n\nI'm not sure what the minimum fine is but it's probably $50 - 100 for an unsafe lane change or something."
          }
        ]
      },
      {
        "score": 3,
        "body": "Apparently chuds think that this happens through microchimerism.",
        "author": "Star___Wars",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "I don't even know what show you are talking about."
          },
          {
            "score": 2,
            "body": "Look it up?"
          },
          {
            "score": 3,
            "body": "Apparently chuds think that this happens through microchimerism."
          },
          {
            "score": 0,
            "body": "It is because Women are being conditioned not to."
          },
          {
            "score": 0,
            "body": "Death to America, I say this as a white british male. They are a satanic country full of wickedness (The UK is not much better tho)"
          },
          {
            "score": -6,
            "body": "Imagine not having children because of easily solveable economic issues, some of which are partly caused by low birthrates in the first place. Don't you feel at least a little shame that you are letting yourself be deprived of having a family because of the profits of bankers and landlords?"
          },
          {
            "score": 1,
            "body": ">this isn't a gotcha any more than that one scene on The Good Place where Eleanor (Kristen Bell's character) gets mad enough that her then-boyfriend criticizes her attendance of a coffee shop owned by someone who's gotten in trouble for sexual harassment that she sets up an ultimatum scenario of go see some sports game despite two of the players having DUIs or stay home and order Chik-Fil-A and watch a Roman Polanski movie.\n\n\nLol, I can't hear you over my loud eating of Juicy, tender ribs. Enjoy watching whatever movie that is with your carrot sticks or whatever.\n\n\nAlso everyone knows that low protein diets lead to small ugly men that have low testosterone, low IQ, poor muscle mass and very, very small penises that cannot please any woman. \n\n\nThis is shown by carniverous mongol tribes being able to easily conquer the entire world because everyone else was so weak, stupid and enfeminate from grain diets, only being stopped by Japanese and Europeans who still kept fish and milk, fish, meat respectively in their diets.\n\n\n\n\nA ruler from a chinese vassal state actually willingly married his daughter to Genghis Khan because he saw what a specimen he was and couldn't deny his daughter the chance to be with a real man who could properly protect her, satiate her sexual needs and give her strong meat-eating genes for her children, he did this because he was a wise man who understood his cultures failings and also because he loved his daughter very much and wanted her to be happy. Her name was Chaka. \n\n\nSoon you will come to respect the carniverous diet and the passion, strength, power and victory that it brings its adherents. You will learn the way of the grill, and the holy, primal statisfaction that comes with eating a well cooked steak cut from a calf that was birthed, castrated, confined and slaghtered meerly to feed me. I have no doubt that you will come around."
          },
          {
            "score": 2,
            "body": "I do not care, also provide proof that every item you own has been ethically produced."
          },
          {
            "score": 1,
            "body": "Is there? If you buy something that you do not need that was made by slaves are you really happy to do so as long as slavery is legal?"
          },
          {
            "score": 0,
            "body": "Its way higher than 90%."
          }
        ]
      },
      {
        "score": 1,
        "body": "How is this unpopular?",
        "author": "SlowInsurance1616",
        "author_hot_comments": [
          {
            "score": 2,
            "body": "The A also goes from Howard Beach to Penn."
          },
          {
            "score": 1,
            "body": "But you have time to protest the protesting on Reddit...."
          },
          {
            "score": 1,
            "body": "Well, the jerk store called. They're running out of you!"
          },
          {
            "score": 3,
            "body": "Or negligent intent.\n\nI don't think *you* have earned the right to be condescending with your complete lack of financial competence."
          },
          {
            "score": 3,
            "body": "Don't defraud the bank?  \n\nMy point was more that it is not like any lender wouldn't see the loan on your credit report.  So trying to borrow $140k more before dealing with the bank is not going to fool anybody.\n\nDid you look at your credit report?  What does it say the loan is?"
          },
          {
            "score": 1,
            "body": "Yeah, I think also committing tax fraud is inadvisable.\n\nConsidering the loan wasn't to buy, build, or improve a home that is their main or secondary residence--and isn't even a home owned by them...."
          },
          {
            "score": 2,
            "body": "When they run credit for the new loan, they will see the old loan."
          },
          {
            "score": 1,
            "body": "So a $180k personal loan they can't pay off...."
          },
          {
            "score": 1,
            "body": "High Low and Every Day Low Pricing are different strategies.  Some customers like looking for / feeling like they have gotten a \"deal,\" and some don't.  JC Penney made that mistake (among others) in moving to EDLP.  Bloomingdales or Saks has a different customer in mind than Walmart or Aldi."
          },
          {
            "score": 1,
            "body": "Trajeek."
          }
        ]
      },
      {
        "score": -5,
        "body": "put virginity, or alpha male or feminism concept aside. discuss rationally",
        "author": "staypositivegirl",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "100% real"
          },
          {
            "score": -4,
            "body": "put virginity, or alpha male or feminism concept aside. discuss rationally"
          },
          {
            "score": 1,
            "body": "my firm has hrconquer corp license and i am using it and passed ! not sure abotu mometrix or porkcet prep , gl!"
          },
          {
            "score": 1,
            "body": "i m on the same path but ive yet fo find anyLLM quality is as goo as API calling directly.\n\nas least for some academic type of output"
          },
          {
            "score": 1,
            "body": "congraz, i passed mine few years back and my firm has corporate pass with [camsexam.com](http://camsexam.com) its a third party one but helped me to prep to score 89"
          },
          {
            "score": 1,
            "body": "u can compare at [passcesga.com](http://passcesga.com) , i'd recommend cesga"
          },
          {
            "score": 1,
            "body": "i think free one is already sfficient, try fraserexam or serdemy"
          },
          {
            "score": 4,
            "body": "i stopped readinga t gold3"
          },
          {
            "score": 2,
            "body": "thanks sir"
          },
          {
            "score": 1,
            "body": "just read [wsetexam.com](http://wsetexam.com)"
          }
        ]
      }
    ]
  },
  {
    "title": "Women who use online dating create problematic men through the “80/20” rule.",
    "content": " \n\nThe constant horror stories about men on dating apps aren't just isolated incidents; they're the result of a completely unbalanced dating market. When the vast majority of women are all pursuing the same small handful of men the ones who fit that specific, \"top-tier\" mold (over 6 foot, high physical fitness, extremely attractive facial features) it completely changes the game. For that small group of guys, they're suddenly flooded with options. This abundance naturally makes any one woman seem more disposable and basically removes any need for them to be accountable for their actions. So, the very behaviors that women complain about being treated as disposable or just being used for sex, the same guy dating multiple women, are the predictable outcome of a dynamic where they are all competing for the same few men.",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1msz1wh/women_who_use_online_dating_create_problematic/",
    "score": 60,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1msz1wh",
    "bertscore_f1": 0.5015550255775452,
    "bertscore_precision": 0.5021051168441772,
    "bertscore_recall": 0.5010061860084534,
    "top_level_comments": [
      {
        "score": 49,
        "body": "This is one of those imo inconvenient truths that the manosphere actually did identify correctly. Anyone who's lived and dated sees it. And ladies that are swiping that way eventually adapt their expectations but it takes a minute",
        "author": "Candid-Maybe",
        "author_hot_comments": [
          {
            "score": 5,
            "body": "I have several female friends who set their height filters to 6ft minimum and proceeded to date a string of really weird dudes. They didn't want to relax the requirement... But eventually did out of necessity"
          },
          {
            "score": 3,
            "body": "I hated Ben stiller til I saw WM.."
          },
          {
            "score": 49,
            "body": "This is one of those imo inconvenient truths that the manosphere actually did identify correctly. Anyone who's lived and dated sees it. And ladies that are swiping that way eventually adapt their expectations but it takes a minute"
          },
          {
            "score": 6,
            "body": "Dude I'm sorry you're 22. Live your fucking life."
          },
          {
            "score": 5,
            "body": "Viable how?"
          },
          {
            "score": -1,
            "body": "The answer is limiting m:f ratios on apps and swipe limits"
          },
          {
            "score": 0,
            "body": "Our rail network fucking sucks. Stop it."
          },
          {
            "score": 1,
            "body": "I think the real answer is we have no damn idea because of their lack of algorithm transparency"
          },
          {
            "score": 6,
            "body": "Honestly asking folks this today is a Rorschach test because many conflate arrogance or overcompensating with masculinity, giving toxic behaviors credit where they shouldn't. I'm biased because I'm naturally more low key but I believe in quiet strength, patience, protectiveness."
          },
          {
            "score": 3,
            "body": "tetris"
          }
        ]
      },
      {
        "score": 43,
        "body": "Hypergamy 101. This deeply ingrained dynamic is probably why monogamy and marriage (and arranged marriage) developed in societies. Otherwise you have a huge underclass of disaffected men who make society very unstable.",
        "author": "GreatPerfection",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "I fundamentally reject the idea that some random group of \"judges\" is in a special position to decide for the rest of us what should be considered the \"ultimate wrongdoing\" by another state. I can come to my own conclusion based on the facts at hand. If this is deemed genocide, then the term genocide has lost any meaning it might have once had.\n\nAs far as legally, I don't care at all. What is legal is not always right.  And besides, this is entirely subjective and based on interpretation of words. It's not like in a murder case where it is being decided whether a person literally did a thing or not. We know what was done, it's just a court making a decision whether to label it bad or not, which I place no value in whatsoever."
          },
          {
            "score": 1,
            "body": "You don't get to decide how people engage."
          },
          {
            "score": 1,
            "body": "Great question. International law was a response to WW2 and is meant to govern conflict between relatively equal nations. The 21st century is proving how outdated the existing international framework is. It completely falls apart when you have asymmetric warfare with non state actors, and one side being held to international treaties but not the other side. At some point, probably soon, the international framework will have to be updated to account for modern realities that didn't exist 80 years ago.\n\nIf you have two people going into a fight, you can't expect one side to agree to binding rules that puts them at a disadvantage while the other person has no such rules."
          },
          {
            "score": 1,
            "body": "The issue isn't a lack of evidence. The issue is the meaning of the word genocide. The legal case is just that - legal. It is about interpretation of legal documents. I couldn't care less about such things. I already know what genocide means to me, and what my standards are. This war does not meet my standards in any way, shape, or form. It's possible that some new development could change that, but for now, it's clearly not a genocide according to the definition I accept. I do not accept the legal definition in international law."
          },
          {
            "score": 1,
            "body": "What are you looking for here? It seems like you are just seeking to have your perceptions validated. You obviously haven't read very much in this subreddit, because the majority of pro-Israeli posters exhibit balanced views that acknowledge Palestinian suffering as well as Israeli wrongdoings.\n\nYou are \"tired\" of hearing about the Palestinian attitude towards Israel but that doesn't make it untrue. So that sounds like a personal problem to me. If the attitudes of Israelis and Palestinians are being discussed, it is valid and relevant to point out that a large majority of Palestinians do now and have in the past exhibited very hostile if not genocidal attitudes about Israel. If you don't want to hear that, don't participate in conversations about the topic.\n\nYour complaint about empathy is a common one but I ask the question, what do you expect people on a discussion forum to do about it? Should we all publicly comment about how bad we feel? Should we make threads where everyone replies, Oh yes it is so bad that children are suffering, Oh yes I feel terrible, This is so bad, I really feel terrible, Very tragic. What is the point of that? Please tell me. Everyone here already knows that war is terrible and that children suffering is terrible. Apparently there is some minimum of public gnashing of teeth via text on the internet is required for us to demonstrate that we care about children suffering? Should we have a paragraph long preface that we add to every single comment where we state how very regretful we are about suffering children? Now I am sure you will take this comment and say, Oh how callous of you, you are making light of suffering. But I am actually being genuine. What do you want us to do?\n\nAs to the rest, I will offer you my position which I consider pretty well balanced. Both Israelis and Palestinians have good reasons to hate each other, considering decades of conflict. Both groups of people surely have members with very negative attitudes towards the other, including the wish to see them all dead. The exact number of these people is unknown and will never be known, but they surely exist on both sides. I will add that this is true for basically any people in a conflict.\n\nThere has been military wrongdoing on each side, but the rate of war crimes is exponentially higher from Hamas than from Israel. Literally every military action that Hamas engages in is a war crime, due to not wearing uniforms to distinguish themselves from civilians, hiding amongst civilians, booby traps, etc. Whereas Israel military actions largely abide by the geneva conventions, with some instances surely violating those and therefore constituting war crimes. No one is perfect, and no war is conducted perfectly - war is inherently chaotic and there are bound to be war crimes, as well as accidents and mistakes resulting in casualties, which is a tragedy.\n\nAt the end of the day, women and children always suffer in war. This is common and obvious knowledge. Given that, it is incumbent upon people who value the lives of their women and children to avoid war. Gaza started this war against Israel, and the war isn't finished yet because Hamas is still fighting. So it isn't Israel's duty to stop fighting just because women and children are dying. It is the Gazans responsibility to come up with terms of surrender that Israel finds acceptable, if they want the suffering caused by them losing this war to stop. This is how war has always worked, and will likely always work in the future. If you don't like it, then you need to propose some kind of new framework that is acceptable to the winning party, because the winning party is the one that has the leverage to determine the terms of surrender. Otherwise, you're just crying into the void, perhaps hoping for some kind of validation for your feelings on the internet."
          },
          {
            "score": 1,
            "body": "Well, congratulations. You live in one of the most isolated, safe, and culturally homogenous places in the world. When is the last time Scotland was invaded? I honestly don't know the answer to that. It's easy to keep your hands clean when you live far away from the troubles of the world. What do you think the Jews attitude would be like if they were given the land of Scotland to live in, instead of being surrounded by people who hate and try to destroy them? All of this demonstrates the pointlessness of criticizing people who live in a radically situation than you do."
          },
          {
            "score": 1,
            "body": "Because I don't accept the \"expertise\" of people in the purely subjective moral realm. And as far as the legal realm, I don't care. Do you understand?"
          },
          {
            "score": 1,
            "body": "Yeah this is hilarious. Let the guy keep digging his hole. He is exposing himself."
          },
          {
            "score": 1,
            "body": "They really should break things down into age categories. Boys at puberty age have been combatants throughout history. Anyone who engages in combat is a combatant."
          },
          {
            "score": 1,
            "body": "Yep, exactly right. The west is digging it's own grave with this intensely cynical and short-sighted weaponization of the international framework."
          }
        ]
      },
      {
        "score": 25,
        "body": "Get so much hate for saying this but who you date is a reflection of who you are. If you consistently date awful men that says a lot more about you.",
        "author": "Stock-Memory9483",
        "author_hot_comments": []
      },
      {
        "score": 19,
        "body": "Women are allowed to date men they are sexually attracted to. Women don’t owe men they aren’t attracted to a relationship. Men need to take accountability and stop shoving it on to women.",
        "author": "ProfessionalStep1691",
        "author_hot_comments": []
      },
      {
        "score": 17,
        "body": "Interesting choice of words, “horror stories,” when what you mean is being continually rejected.  Of course that is demoralizing and hurtful, it can really tank your mental health, but a horror story?  There are far, *far* worse outcomes possible.",
        "author": "EpiphanaeaSedai",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "You’re reading things into what I’m saying that aren’t there - and I’d guess you consider yourself one of the good men."
          },
          {
            "score": 1,
            "body": "Not in a broad and comprehensive sense, no, but they may be on this one matter.  \n\nWhat do you think they are, then, in terms of the psychology of the act?  How do you explain it?"
          },
          {
            "score": 1,
            "body": "So even if you never swing back, you’re not taunting him, you’re literally standing there - in your view, at some point it ceases to be his fault alone that he’s hitting you?  At some point the person being hit, unprovoked, shares the responsibility for the aggressor’s actions?\n\nI understand that you think it’s dumb to stand there and be hit.  I think it’s more complicated than that, but I’ll agree that it’s not a good life choice if you can avoid it.  I would advise against it.  \n\nBut that’s not the same as fault or responsibility.\n\nSuppose you’re standing by a door on a windy day, and the door keeps swinging and hitting you.  If you continue to stand there, it’s your fault when the door hits you again.  That’s because there is one person with the capacity to change this situation and it’s you.  The door isn’t choosing to hit you, and the door has no moral duty to not hit you.  It isn’t alive or aware at all, it’s a door.\n\nNow if another adult human being is hitting you, and you don’t flee, *that person is fully capable of not hitting you again.* They have a moral duty not to hit you again, or in the first place, for that matter.  They aren’t a door in a high wind, they’re a person with free will making a choice."
          },
          {
            "score": 1,
            "body": "No, that is not what I said.  I said that women still would not date men they aren’t attracted to, and that more women would be single.  They’d pick *no one.*\n\nNo sex at all is better than sex you don’t want to be having.  This seems to be inconceivable to many men, but it is how most women feel."
          },
          {
            "score": 1,
            "body": "I think that *would* fly, though, if it was demonstrably true.  It would be an insanity plea. \n\nNow obviously, a woman can sincerely believe an embryo is a clump of cells of no moral significance without being mentally ill.  But insanity in the legal sense doesn’t necessarily mean mental illness, and mental illness may not be insanity.  \n\nJeffrey Dahmer was found to be sane.  I think no one needs a background in psychology to say that Dahmer was clearly, profoundly mentally ill. But he wasn’t unaware that his actions were wrong.  He understood the nature of his crimes, he just didn’t care, because he enjoyed killing. \n\nOn the other end of the spectrum is Matthew Taylor Coleman, the father who killed his two young children because he’d been sucked into bizarre conspiracy theories and sincerely believed that they would grow up to be monsters and that he had a duty to kill them. He took no enjoyment in it and gained no benefit from it, by all accounts he was grief-stricken over it - but he thought he had to, that it was the right thing to do.\n\nHe was found not competent to stand trial, last I heard.\n\nThat is legal insanity. \n\nThese are extreme examples, of course, but I think the average woman who aborts in the first trimester is much closer to Coleman than Dahmer in terms of culpability."
          },
          {
            "score": 0,
            "body": "I don’t need to make all the prochoice arguments people give for why they think an embryo or fetus isn’t quite a person yet - you’ve definitely heard them all.  What’s at issue is whether the people making these arguments actually believe them.  I think many do. Go over to the abortion sub and read (not brigade); it’s really upsetting stuff, but you need to understand what we’re fighting."
          },
          {
            "score": 1,
            "body": "Did you even read my reply?"
          },
          {
            "score": 1,
            "body": "This is a large part of how I feel too - I can’t see sending rape victims to prison.  \n\nBut, I also can’t see making people conceived in rape second-class citizens with no right to their own lives.  \n\nThere’s no really good or fair way to reconcile this; the answer is that no one should ever be in that position in the first place.  The best I’ve come up with, if we are going to criminally charge women who abort, is to make trauma from rape an affirmative defense.\n\nI’m much less interested in punishment than prevention in general, though, and I think when 1 in 5 pregnancies will be aborted we very clearly have a systemic problem.  I think the figure that 1 in 4 women will have an abortion by age 45 is probably exaggerated, but even if it’s half that, that’s not going to be fixed by punishing individual bad actors.\n\nAnd I also come back to the very basic principle that when a healthy animal destroys its own young, we can conclude that something is very wrong with the conditions in which it is living.  Neonaticide is a stress response; in animals that can reabsorb a pregnancy, it is a stress response. We’ve put a man on the moon and we can transplant hearts, why in the hell are we unable to give the average person a life that doesn’t induce homicidal tendencies?"
          },
          {
            "score": 1,
            "body": "Yes and no.  \n\nIn the US, there is ‘black culture’ because there is a large population of people of African descent whose ancestors were abducted and brought here as slaves.  Families were split up, over and over across generations.  Culture and history were lost and any sense of heritage and cultural identity was deliberately stamped out.  \n\nStudies of Holocaust survivors also tell us that population-wide trauma of that magnitude causes epigenetic changes that are passed on to future generations.  Those who go through something like that are very literally a changed people.  \n\nA new cultural identity had to be built, and was, that is unique to that American experience.  When someone in America speaks of Black culture, that is what they mean.  There are subcultures within that culture, too.  \n\nThat does not mean that having dark skin and African features makes one part of that culture. People of a multitude of backgrounds look like that, just as ‘white’ people can belong to many possible ethnicities.  \n\nPresent day experiences and social context have their influence too.  A white person and a black person who both grew up in the same region of the US will have much more in common culturally than the American black person and a black person from Nigeria.  \n\nThere are absolutely regional cultures in the US that are predominantly white.  That isn’t the same as “white” being a culture.  A white person from rural Texas whose family has lived there for generations, and a white person from NYC descended from generations of New Yorkers, will have different accents and idioms, different ideas of courtesy, different commonly eaten foods, different holiday traditions, likely listen to different music, dress differently, recognize different markers of socioeconomic status, etc, etc. And they will still likely have more in common with each other than with someone of similar appearance from Norway or Portugal."
          },
          {
            "score": 0,
            "body": "It might, actually, depending what manner of “didn’t believe they were human” we’re discussing. \n\nIf you think your victim didn’t deserve to live because you’re a bigot and they were part of a demographic you hate, too bad.  If anything, that’s an aggravating factor. \n\nIf you thought your victim was actually a lizard person who was part of a conspiracy to take over the world and it was your moral duty to kill them because the voice of God in your head said to, you are not guilty by reason of insanity.  You are still going to lose your freedom, because you will be confined to a secure psychiatric facility until such time as you are deemed no longer a danger to yourself or others.  \n\nIf you were out in the woods and shot at what you thought was a deer, but turns out to have been a homeless man in a brown hat with ear flaps tied up, you are guilty of manslaughter.\n\nIf your prankster buddy knows you’re terrified of bears and decides to hide in your bushes in a realistic bear suit and jump out at you, and you shoot him, in all likelihood you’re not going to be found guilty of anything."
          }
        ]
      },
      {
        "score": 5,
        "body": "This is the truth. Dating and sex preferences all come down to supply and demand. And those in demand are given license to both be selective and be douchebags.",
        "author": "Ryan_TX_85",
        "author_hot_comments": [
          {
            "score": 2,
            "body": "I don't doubt it. There are definitely tops who like the idea of \"conquering\" bigger guys and making them submit."
          },
          {
            "score": 1,
            "body": "How about mind your own bedroom?"
          },
          {
            "score": 1,
            "body": "Everyone who can work from home would work from home. The vacated office space would be turned into housing for the homeless and people on the verge of homelessness. Anyone who can't work from home would get a 4-day, 32-hour work week with no reduction in pay. This would solve the homeless problem and high gas prices all at once. I'd implement universal heath care and a living wage tied to inflation. Billionaires would be taxed out of existence. I'd probably spend the first 100 days undoing everything Trump has done. I'd require ICE agents to unmask and carry badges. I'd shut down Alligator Auschwitz and grant every illegal immigrant with no criminal record amnesty and a path to citizenship by executive order (if Trump can legislate by executive order, so can I)."
          },
          {
            "score": 1,
            "body": "Incidental outdoor exposure to smoke is harmless. You're more likely to be harmed by pollution in a major city. It's the people who live with indoor smokers who face health risks. Considerate smokers go outside these days."
          },
          {
            "score": 1,
            "body": "I'm into bottoms who are at least one head shorter and less masculine than me."
          },
          {
            "score": 6,
            "body": "Trump supporter"
          },
          {
            "score": 3,
            "body": "Forget car sex. Do it in a bed, where you have all positions available."
          },
          {
            "score": 43,
            "body": "You're crazy. The 1979 Islamic revolution in Iran couldn't have been more right-wing. Sharia law is right-wing. Everything about Islamic society is right-wing."
          },
          {
            "score": 3,
            "body": "It's not hot. It's desperate. And it limits your sex options."
          },
          {
            "score": 4,
            "body": "Pick any Scandinavian country."
          }
        ]
      },
      {
        "score": 4,
        "body": "The 80/20 thing is a myth made up by the 80% of men to make themselves feel better for not getting dates, when the reality is that the short ugly men will treat you just as badly as the cute tall ones because they've got a chip on their shoulder over some concept that women have never actually subscribed to.\n\nIt's a cycle:\n\nThey convince themselves that women won't date them because they're ugly and not because they have shitty attitudes > women date them despite their shitty attitudes > they treat those women badly because they think that woman is settling for them > women don't date them because they've got shitty attitudes > they convince themselves that women won't date them because they're ugly and not because they have shitty attitudes.",
        "author": "Ok_Student_3292",
        "author_hot_comments": [
          {
            "score": 15,
            "body": "You have a fundamental misunderstanding of what humanities PhDs are."
          },
          {
            "score": 7,
            "body": "No, we wouldn't, and the fact you think that culture wouldn't be affected without humanities degrees is exactly why we need them."
          },
          {
            "score": 3,
            "body": "So women having a choice and freedom in who they date is terrible for men?"
          },
          {
            "score": 6,
            "body": "You do understand that the average person doesn't rank other people out of anything?"
          },
          {
            "score": 2,
            "body": "From the article you linked:\n\nSome research also points to the possibility that short men may have less than desirable personalities. A study published in the Elsevier journal Personality and Individual Differences, conducted by a group of Polish scientists on 367 men and women, has found intriguing results concerning short men's behavior. The research, titled \"The Napoleon complex, revisited: Those high on the Dark Triad traits are dissatisfied with their height and are short,\" suggests that shorter men might compensate for their height with antagonistic behaviors, exhibiting traits known as the Dark Triad—psychopathy, narcissism, and Machiavellianism.\n\nThese findings lend credence to the theory of the Napoleon complex, named after the relatively short French Emperor Napoleon Bonaparte, who was known for his aggressive leadership style. Shorter men exhibiting the Dark Triad traits might be embracing an adaptive strategy, making up for their perceived physical shortcomings with psychological assertiveness and ambition. Perhaps women subconsciously know that short men have a higher likelihood of having the so-called Napolean complex, or maybe they have experienced some unpleasant experiences in the past with shorter men.\n\nThe numbers might seem disheartening for shorter men, but they don't paint the full picture. Physical appearance is just one aspect of attraction, and what truly resonates with people is far more complex and nuanced. There are plenty of examples of women who have married men on the shorter side (or even men who are shorter than them) because they find them to be irresistibly charming. At the end of the day, men attract women because of their humor, success, and ability to protect and provide. There are plenty of men out there who are able to do all of these things regardless of their height. Couples like Sophie Turner and Joe Jonas, Priyanka Chopra and Nick Jonas, and Benji Madden and Cameron Diaz are some of the famous celebrity duos who defy the common statistics. Attraction and interest never boil exclusively down to looks, and men who know that and lead with other characteristics often have no problem dating in the real world."
          },
          {
            "score": 2,
            "body": "Yes, we do."
          },
          {
            "score": 2,
            "body": "But the argument is that 80% of men aren't getting dates because women only want men who are attractive and rich and tall and whatever else puts them in that top 20%, and so 80% of women go for 20% of men.\n\nI'm arguing, as are several women on this thread and the post in general, the reality is that these men in the bottom 80 are fine. It's a box they've put themselves into. But they're either only going for uninterested women or they spend more time complaining about how women don't go for them than they do actually putting themselves out there. Myself and others have talked about how we went on dates with these guys who claim they're in the bottom 80 and their issue wasn't their appearance or income, it was that all they did was complain about how they didn't get girls. While on a date with a girl.\n\nAlmost half the population is married (as in currently, and not divorced). Just by that, 80/20 doesn't hold up, unless these top 20% men are somehow marrying 50% of all women."
          },
          {
            "score": 2,
            "body": "I'm saying they aren't getting dates because of their personalities, not because they're short or broke."
          },
          {
            "score": 4,
            "body": "I always read the bios and I would never try to match with a guy who is making an ostentatious show of wealth in his profile. It's tacky and suggests he's more focused on splashing his cash than actual connection."
          },
          {
            "score": 6,
            "body": "It's not the looks, it's the personality. Why would a woman date a man who is comfortable ranking her out of 10?"
          }
        ]
      },
      {
        "score": 4,
        "body": "You forgot money, the top tier dudes usually have money & resources so they always get the pick of the bunch even if they're not that physically attractive.",
        "author": "Slightly-Evil-Man",
        "author_hot_comments": [
          {
            "score": 56,
            "body": "RIP to one of the few good judges who actually had a heart."
          },
          {
            "score": 2,
            "body": "It was the generation before us that created everything currently causing us all problems though💀"
          },
          {
            "score": 1,
            "body": "They're too close in age of course they fight all the time😂\n\nThey need a time skip, they would probably be closer as adults, the maturity would even it out. I think they would eventually have come to some kind of ceasefire if the show wasn't cancelled mid-season, I started to notice them bonding more going into season 3."
          },
          {
            "score": 1,
            "body": "![gif](giphy|DOPKHQg6oFWUg)\n\nlookin ah😂😂😂"
          },
          {
            "score": 1,
            "body": "Didn't even make it an entire business week befor being a thot...give her back bro, she's for the grimey cobblestone streets💯"
          },
          {
            "score": 1,
            "body": "*NeverBlinkAgain*"
          },
          {
            "score": 1,
            "body": "That's just something stupid people say to justify whatever bs they're saying just to get away with it feeling as though they've \"won\". Arguments at their core are passionate debates and even though perspective and context are very important, so are facts. Being able to talk through things calmly and logically should be something every adult knows how to do honestly.\n\nSome people have a hard time accepting or aknowledging when they are wrong. The only time an argument is \"immature\" is when it devolves into yelling, people are just waiting to react to the next thing said, and/or someone's actively saying things they *know* will hurt the other person. Disaggreements are inevitable, but knowing how to express your thoughts and feelings in a coherent and reasonable way is the epitome of maturity, if you can work things out through listening and understanding there's a better chance of it not becoming a huge issue."
          },
          {
            "score": 1,
            "body": "No but it is the cause of our immediate problem which is inflation. Due to capitalism being busted and wages not keeping up with the cost of living, everyone is sufferering except the rich financially. If we don't have happy fullfilling lives we can actually afford to live of course morale will fall and with it the urge to date. \n\nEverything costs more than it should and most regular earners can't justify spending money on dates that *might* lead to something down the line. The juice isn't worth the squeeze anymore especially since low-cost dates are seen as \"low effort\", now it's discouraging to even try to date on a budget because that is often frowned upon and not many are open to that."
          },
          {
            "score": 1,
            "body": "Kagome that doesn't work anymore I'm not actually th--\n\n*SLAM*"
          },
          {
            "score": 6,
            "body": "Inuyasha: \"First time?\""
          }
        ]
      },
      {
        "score": 4,
        "body": "[deleted]",
        "author": "[deleted]",
        "author_hot_comments": []
      },
      {
        "score": 2,
        "body": "Women have access to makeup and endless fashion and add-ons, fake lashes etc. They conflate how they look when they're coated in layers upon layers of fakery with how they really look. So every 4 out there thinks shes a 10 and they won't take less than perfection from a man. These men will gladly hook up with them but they won't commit. This is utterly baffling to these 10's (4's.) Literally inconceivable that these men are smart enough to know they're way out of those women's league and it creates an endless cycle of increasingly bitter women who then take their ire out in the men they don't see as people( anyone under a 7.)",
        "author": "Mean-Independent7118",
        "author_hot_comments": [
          {
            "score": 54,
            "body": "Republicans are always blocking things that they swear they're in favor of. Just a bunch of silly guys."
          },
          {
            "score": 0,
            "body": "I was old enough to remember that pretty clearly. They spent months talking about it for 6 hours a day minimum. When he fist bumped his wife they spent a year devoting half the daily air time to feigning terror and pearl clutching over the \"terrorist fist jab.\""
          },
          {
            "score": 1,
            "body": "I farmed after night 2 for like 2 hours. Pushing the absolute limits of how far I could travel until there were no more field bosses or items in reach. Overdosing on bolluses with weapon passives micromanaged to an autistic degree. I had a list of buffs from bosses so long it brought a tear to my eyes. With 4 wending graces and the power of the rotting woods i spammed rivers of blood ash while munching blue shards with my roided out Wylder who had poise buffs that let him tank all but the most potent of smacks from Libras staff. I killed him with one revive left. It was the most fun I've had in this game so far and I'm gonna do it again tonight."
          },
          {
            "score": 0,
            "body": "Women have access to makeup and endless fashion and add-ons, fake lashes etc. They conflate how they look when they're coated in layers upon layers of fakery with how they really look. So every 4 out there thinks shes a 10 and they won't take less than perfection from a man. These men will gladly hook up with them but they won't commit. This is utterly baffling to these 10's (4's.) Literally inconceivable that these men are smart enough to know they're way out of those women's league and it creates an endless cycle of increasingly bitter women who then take their ire out in the men they don't see as people( anyone under a 7.)"
          },
          {
            "score": 1,
            "body": "Doesn't he post like hundreds of tweets a day all day long? He's not working it's just the image people have of him. He tells people he works all the time and they just believe him because hes rich and most people are gullible idiots. Sometimes he gets caught like his Diablo/POE \"I'm the best gamer in the world\" BS."
          },
          {
            "score": 7,
            "body": "Scariest movie I've ever seen. I screamed every time her face was on screen."
          },
          {
            "score": 5,
            "body": "Before he left all that remains I'd say Jason Richardson."
          },
          {
            "score": 1,
            "body": "You should check out Shane Gillis' review 😅"
          },
          {
            "score": 1,
            "body": "Is this patriarchy?"
          },
          {
            "score": -49,
            "body": "And yet women kill the majority of toddlers. But we send our kids to daycares and schools run by them."
          }
        ]
      }
    ]
  },
  {
    "title": "If you're ugly, they tell you to \"be more confident\" but they get annoyed with you when you are.",
    "content": "As the title says. And the opposite is also true. If you are a good looking guy, people warn you about being too \"cocky\" but they love it when you are. I've found that the women around me tend to link \"attractive\" and \"confident\" together, or atleast the two qualities \"complete\" or \"complement\" each other.\n\nI remember while in university thinking \"I need to be more confident\" when presenting my ideas to the rest of the class or to other people but I found that people hated it. Almost like (and this is an internalization on my part) they thought \"Oh jeez you're ugly, you should be fitting the part and stay silent\" and I even had a girl rage at me in the cafeteria for that very reason. And yet, nowadays, I will talk about how no one outside of my family likes me very much and one thing they always say - especially online - is \"be more confident!\" I swear that has to be the oldest platitude in the book by now. You can pretty much go on autopilot with it while giving \"advice.\"\n\nBut, it's no secret that everyone likes the good-looking guy being overconfident. They will believe everything he says and give him all the attention in the world while at the same time those are the kinds of people we tend to warn against being too overconfident.\n\nI dunno. It all seems to go hand in hand. And hypocrisy isn't something I stomache very well. Maybe that is why I am so cynical now.",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1mtyjzb/if_youre_ugly_they_tell_you_to_be_more_confident/",
    "score": 58,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1mtyjzb",
    "bertscore_f1": 0.5014421939849854,
    "bertscore_precision": 0.49329179525375366,
    "bertscore_recall": 0.50986647605896,
    "top_level_comments": [
      {
        "score": 16,
        "body": "The perception of your personality is linked to the halo effect. A cocky attractive guy will simply be tolerated more.",
        "author": "Living-Yak6870",
        "author_hot_comments": [
          {
            "score": 65,
            "body": "https://preview.redd.it/6e2pjhhvl6kf1.jpeg?width=680&format=pjpg&auto=webp&s=cd06950242a1bc4043e7253884c8f7b17b0a1d6b"
          },
          {
            "score": 1,
            "body": "Always wear a condom if you don't trust the women you're sleeping with to regularly take birth control IMO. It's better not to be in this situation in the first place OP."
          },
          {
            "score": 1,
            "body": ">Hundreds of millions of ugly men have partners though.\n\nMen tend to underrate other men and overrate women. Most average looking people can date/marry each other."
          },
          {
            "score": 1,
            "body": "> neoliberal view in immigration \n\nThe neoliberal view is correct though unless you're talking about illegal immigrants (who still pay taxes). You can do extensive research on this and find that immigrants are a net benefit.\n\nThe anti-immigration types are literally just straight up racist or nativists. They don't care about the economy or the effects of declining birth rates in the country."
          },
          {
            "score": 32,
            "body": ">If you can’t get over it after 200 years\n\nIt's a literal museum."
          },
          {
            "score": 1,
            "body": ">The blackpill may have some amount of truth in it but incels take it to ridiculous lengths that can't be justified by the evidence, and higher IQ people are more likely to be able to see through that.\n\nAgreed. The only things I found that were legitimately good advice on blackpill sites (visited them out of sheer curiosity) was having low body fat (10-12% bf is recommended) to look more attractive (since it makes your face look more defined) and plastic surgery if you're way too unfixable. The rest was toxic ideology."
          },
          {
            "score": 1,
            "body": "If you're looking at it a social darwinistic way sure. That way of thinking lacks empathy for other human beings though. They didn't really choose their situation. \n\nI would say that it would only improve the gene pool when it comes to looks. Low IQ people have no issues reproducing."
          },
          {
            "score": 17,
            "body": "https://preview.redd.it/i73ak2e06wjf1.jpeg?width=638&format=pjpg&auto=webp&s=a66317e1bc06233b4dccde3059058a19d3ea5d97"
          },
          {
            "score": 7,
            "body": "They have to be pragmatic to win elections. We can shift the overton window later bro.\n\nEdit: Also he's just joking and mocking Trump."
          },
          {
            "score": 7,
            "body": "I don't see Newsom winning a presidential election simply because he's from California. (Tons of right wing propaganda and envy that democrats run the 4th largest economy in the world).\n\nCalifornia is the most hated state in the country and people from swing states especially hate California."
          }
        ]
      },
      {
        "score": 14,
        "body": "Both physically unattractive men and women are told to be more confident. The result is clearly unwanted. It’s a paradox.\n\nMost people like to see confidence and conventional beauty combined. But when they see otherwise combined with confidence, the judgement comes out. All of a sudden, it’s “you’re too ugly for that attitude” or “who do you think you are?”\n\nIt’s an inevitable double standard.",
        "author": "No-Ad8127",
        "author_hot_comments": []
      },
      {
        "score": 10,
        "body": "I had a coworker ask why I was always single and I told her that women didn't like me all that much. She said I should be more confident. So I told her that I'm confident that women don't like me all that much. She called me arrogant, lmao.",
        "author": "According-Tea-3014",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "That's funny because \"too big\" is never body shamed, is it?"
          },
          {
            "score": 9,
            "body": "I don't see how that deligitamizes what she was doing."
          },
          {
            "score": -3,
            "body": "The vast majority care about size"
          },
          {
            "score": 12,
            "body": "Its always kinda funny to see how women will talk about these kinds of toys, and you can pretty much tell they're lying through their teeth.\n\nI've seen women say it's about variety, but when you ask, they never actually ask their partner to use anything smaller, only bigger. Somehow, these people have it in their mind that \"always bigger\" is variety.\n\nOr they'll tell you how accepting they are of their partner's body, but don't even stop to think that asking their partner to wear a better dick is actually not that accepting."
          },
          {
            "score": 1,
            "body": "Is that why Trump is lightening up the accommodations  his Pedo friend's wife?"
          },
          {
            "score": 1,
            "body": ">Because it's not actually deal breaker for most women, \n\nWhat was it you were saying about generalizations? I always find it kinda funny how people will wag their finger at you for generalizing, just to turn around and generalize in the exact opposite direction, but I'm sure it doesn't count because its a generalization that you personally agree with, right?\n\n>Dude, just listen to yourself here. You can't even keep your own story straight, claiming it's the \"vast majority\" then conflating that with \"more than half\". Even if it were only a minority that didn't care or like shorter men, that's still a shit ton of people.\n\n\nMy story has been very consistent. The *vast* majority of women care about their partner's height and will not date men shorter than they are. And then a minority will not care, which naturally means that they're also willing to date men who are taller. And statistically speaking, the average man is taller than the average woman, so guess which is more likely to happen? Even women who \"prefer\" shorter men will still date taller men. Which essentially just invalidates that \"preference\".\n\n>No, they're things you've convinced yourself are true to shield your ego from having to admit you might be wrong about this and need to work on your attitude.\n\nYou disagreeing and not experiencing the same thing does not prove that I'm wrong."
          },
          {
            "score": 1,
            "body": ">A mild preference\n\nIf a guy being shorter than you is a deal breaker, that is not a mild preference. That is a hard line. That is how this type of preference typically works.\n\n>Especially since if it were true, a huge swath of the population would not be in relationships that clearly _are_ in relationships.\n\nIt's almost like I said it wasn't all women. But you're lying if you sit here and say you see more men who are shorter than their partner than men who are taller than their partner.\n\n>This is what I mean, you're looking to use it as a scapegoat in every possible way your can imagine instead of admitting to yourself that you need to work on your insecurity.\n\nNo, I'm not. Lmao. I'm pointing out things that are *very observable*, you just disagree with them because it wasn't your experience.\n\n\n>And for the record, some of them _do_ prefer shorter men. Hell, I specifically remember at least two back in highschool that would only date shorter men, and that was out of the small-ish group of women in my HS whose preferences I even knew.\n\nSo, two women, out of a school how big? Man. Sure proving me wrong about that whole \"vast majority thing\".\n\nBut sure, if we ignore how the word \"preference\" seems to change depending on what preference we're talking g about, then yeah. Some women have a \"preference\" for shorter men."
          },
          {
            "score": 1,
            "body": ">But you're turning it into this massive generalization and using it to scapegoat every negative experience or lack of success you've had, acting like this is the _only_ thing that happens. That it's the **the** reason people don't find you attractive. That you're then acting like this is something _all_ women do. Which is nonsense.\n\nIt isn't all women. But it is the *vast, VAST* majority of women. There are so many available studies that prove women absolutely care about height, at least to the point that again, the vast majority would not date someone shorter than them.\n\n>And anecdotes work both ways - virtually none of the women in my life give much of a shit about height.\n\nNotice the difference in wording? We've gone from preference to \"not caring\". I can't help but notice that there isn't a preference for short. \n\n>Your extreme insecurity is the problem here. Insecurity happens, I'm not shaming you for that, I'm shaming you for refusing to admit that it's even an issue you have.\n\nI'm fully aware of my insecurities. But they don't exist ina vacuum, I wasn't just born with them. They are the result of lived experiences. You telling me \"it doesn't happen\" doesn't actually change anything."
          },
          {
            "score": 1,
            "body": ">if more women preferred taller men than not (debatable), the reality is that real people have a huge range of preferences\n\nIsn't it amazing how \"varied\" these preferences are, but somehow, still only body shame one body type. And just as a quick hint, it's definitely not tall men. Women are body shaming. \n\n>I get that there's a lot of shitty garbage on social media that's pushing you to think the way that you are, but it doesn't make it true.\n\nThe crux of your argument depends on men not having actual lived experience with women straight up telling them their height is unattractive. Just because *you* don't believe it happens, doesn't actually mean it doesn't happen.\n\nFor example, all my friends married plus sized women, so obviously that proves that women are never rejected for their weight, right?"
          },
          {
            "score": 1,
            "body": "It absolutely is. Having an overinflated ego just cause you were born lucky is peak tall-man syndrome, and they deserve to be body shamed as much as short men are."
          }
        ]
      },
      {
        "score": 8,
        "body": "Women say that to men of any appearance, because it further entrenches them into higher valuation by being the one chased.\n\nThey also know many of them couldn't do it themselves - approach us. Their fear of rejection is much higher than ours, and they know whatever confidence they had would be eroded with further rejections(something we have in common)\n\nSo they'll continue to give out this advice because they enjoy this gender role, not realizing that the only guys left approaching them don't have any confidence left as it wasn't necessary to begin with; they're practically psychopathic",
        "author": "philmarcracken",
        "author_hot_comments": []
      },
      {
        "score": 1,
        "body": "Who is “they”",
        "author": "Low_Shape8280",
        "author_hot_comments": [
          {
            "score": 37,
            "body": "And then kill some  innocent guy behind him"
          },
          {
            "score": 14,
            "body": "Yep this is the same as hair pieces. They are so good now a days we can’t tell"
          },
          {
            "score": 8,
            "body": "I mean not far from reality. This mf thought he could just draw a map of probably where the hurricane could go"
          },
          {
            "score": 6,
            "body": "Gods a dick lol"
          },
          {
            "score": 6,
            "body": "How is that a scam"
          },
          {
            "score": 1,
            "body": "If that’s what you got to think"
          },
          {
            "score": 1,
            "body": "Its the reflection of I got mine fuck you im done learning anything new and i dont want to empathize with anyone outside of my direct community. \n\n\nIts a reflection of a group of people who had it to good for to long and think the world is a shit place if the slightest inconvenience comes up"
          },
          {
            "score": 1,
            "body": "\n\n\nNobody including the person who ran against him ."
          },
          {
            "score": 1,
            "body": "Super unpopular opinion but I like the smell of cigar smoke sometimes out in public"
          },
          {
            "score": 2,
            "body": "Make money. Stay fit enjoy"
          }
        ]
      },
      {
        "score": 2,
        "body": "The internet isn't reality. Well, in real life, people aren't usually as critical as they are online. \"Be more confident\" is actually always good advice, because someone truly confident wouldn't pay attention to pointless criticism about their looks. The problem is how to achieve true confidence and not fake it.\n\n\"Look how horrible he is and has high confidence\"\n\nWell, this literally sounds like a typical comment from a random 12-year-old on TikTok, not something anyone remotely respectable would say in real life, to be honest.",
        "author": "Smendoza170",
        "author_hot_comments": [
          {
            "score": 79,
            "body": "I've always said that nostalgia is actually a negative emotion. Nostalgia is practically the definition of gaslighting. It makes you think that the old days were always better because your brain selects the good times and discards the bad or boring ones, it's an illusion"
          },
          {
            "score": 2,
            "body": "Puede ser algo muy normalizado, pero no deja de ser superficial. \n\nDescartar a alguien solo por la apariencia deja de lado otras cualidades de esa persona que quizás te parezcan atractivas, pero nunca lo sabrás porque ya lo descartaste de primeras. Es como juzgar a un libro por su portada nada más. \n\nNo digo que esté mal, cada quién con sus decisiones, pero es superficial, las cosas como son."
          },
          {
            "score": 7,
            "body": "I think this has to do with the self-love you have for yourself. \n\nThe fear of being \"secretly hated\" is the symptom. The illness is the belief that you need others' approval to feel worthy. \n\nThe main idea would be to question that thought and look for evidence that confirms it (usually there isn't any). Thoughts are not reality \n\nA person with self-love does not communicate seeking the approval of others because they know that no matter the outcome of the conversation, they will be able to overcome it and move forward without that being less important, their self-esteem and their own worth."
          },
          {
            "score": 12,
            "body": "It's definitely the best advice, but it's really hard to achieve. Gaining self-confidence is a long and complex process, not as simple as it often seems.\n\nLoving what you hate about yourself, not paying genuine attention to disparaging comments about you, not even believing your own inner voice, and It's something that takes a lot of time and effort and I think that's why a lot of people hate this advice. \n\nBecause people always tell you to have confidence and self-love, but very rarely do they tell you that it's an extremely complex and time-consuming process."
          },
          {
            "score": 3,
            "body": "Si el secreto afecta directamente a tu pareja, es necesario decirlo. Si es un secreto que no afecta a nadie más que a tí mismo, lo podes guardar. \n\nTener secretos es algo humano y para nada algo inmoral, es privacidad."
          },
          {
            "score": 2,
            "body": "The internet isn't reality. Well, in real life, people aren't usually as critical as they are online. \"Be more confident\" is actually always good advice, because someone truly confident wouldn't pay attention to pointless criticism about their looks. The problem is how to achieve true confidence and not fake it.\n\n\"Look how horrible he is and has high confidence\"\n\nWell, this literally sounds like a typical comment from a random 12-year-old on TikTok, not something anyone remotely respectable would say in real life, to be honest."
          },
          {
            "score": 16,
            "body": "Mucho internet...\n\nTe reto a salir a la calle, un restaurante o algún lugar donde hayan parejas y los observes atentamente. Te darás cuenta que la GRAN mayoría de personas salen con personas comunes sin nada especial, no se ve que sean guapos, altos o que tengan mucho dinero.\n\nSi la gente fuera tan crítica como lo es internet, nuestra civilización estaría extinta."
          },
          {
            "score": 13,
            "body": "When I have to greet anyone, that initial comment frustrates me because it often involves a conversation. Most of the time, I don't know what to say."
          },
          {
            "score": 146,
            "body": "Too much internet...\n\nJust try this experiment, go out on the street, to a restaurant or whatever where there are couples and tell me what you see? You'll see that people behave very differently in real life than in virtual life.\n\nMost people hang out with average people with nothing fancy. Many of them aren't good-looking or anything, they don't seem to have much money, in short, it's all a lie."
          },
          {
            "score": 6,
            "body": "Exposure therapy. I know it doesn't work for a lot of people, but it worked great for me. It's horrible at first, but over time it gets easier. You should plan every interaction and try to do it every day, from the easiest to the most difficult."
          }
        ]
      },
      {
        "score": 1,
        "body": "Yeah a lot of these clowns have zero clue what they’re talking about.",
        "author": "TPCC159",
        "author_hot_comments": [
          {
            "score": 10,
            "body": "Chicago is largely self segregated these days tbh"
          },
          {
            "score": 9,
            "body": "Nobody’s offended. Anyone who doesn’t like being in America can feel free to kick rocks."
          },
          {
            "score": 2,
            "body": "Hockey as well. Tall fit men from upper class Caucasian background definitely will always appeal to people"
          },
          {
            "score": 1,
            "body": "Follow wherever your best support system is. Life is all about relationships. If you have a really strong friend group, stay in Canada. If you don’t, head south especially if your mom moved back to the states"
          },
          {
            "score": 3,
            "body": "Read that a lot of white people moved to Ft.Lauderdale after all the migration from Latin America in the 1970s and 1980s"
          },
          {
            "score": 3,
            "body": "Also the crime rate in Memphis is out of control. Makes sense how nobody wants to touch that. City schools in high crime cities (Tulane, Temple, etc) tend to get the cold shoulder a lot"
          },
          {
            "score": 40,
            "body": "False alarm like always"
          },
          {
            "score": 4,
            "body": "Meals on Wheels needs 15 volunteers"
          },
          {
            "score": 5,
            "body": "Indian is a nationality. People say stuff about Nigerians, Somalis, Haitians and Jamaicans all the time."
          },
          {
            "score": 3,
            "body": "Attention"
          }
        ]
      },
      {
        "score": 1,
        "body": "Confident people make losers feel bad about their self.  \nThe moment you realize that it has nothing to do with you but them, then you'll stop caring.",
        "author": "Tampa_FL_fuckboy",
        "author_hot_comments": [
          {
            "score": -8,
            "body": "I never said people hated him. You couldn't even pay attention to my comment."
          },
          {
            "score": -20,
            "body": "Contrarians find things to be cool if they're not popular."
          },
          {
            "score": -27,
            "body": "Contrarian pick.  He's the last one who will be unlocked.  people only like him to be contrarian."
          },
          {
            "score": -4,
            "body": "No one cares about him, you're just making a post to be contrarian."
          },
          {
            "score": 5,
            "body": "Arrogant is a compliment.   \nAsk most women if their \"ex\" was arrogant, and 100% will say yes.  \nThe moment you realize that 100% of them dated arrogant people, you will realize you got complimented."
          },
          {
            "score": 3,
            "body": "Nothing has changed.  \nIt's only a mind bender because we tend to project onto other people.  Attraction has nothing to do with what we think we want from someone.\n\nAll women are physically attracted to the same things.  \nIn their head they have different fantasies about what type of man they want.  (Due to media propaganda and romanticizing relationships)   These mental fantasies change with time.  \nBut their body is physically attracted to the same things that they were attracted to thousands of years ago.  Dating propaganda focuses on mental fantasies, so you see lots of women fantasizing about the type of guy they want.  But their body still responds the same as any woman which is how they feel confused as to why they keep going for the same type of guys they \"hate\".  \n\nThey aren't self-aware of what they're physically attracted to, which is why you see them contradict their self so much.  You basically will go crazy if you try too understand them.   I don't believe anything they say.  They will say they are saving their self but then let me have sex a couple hours later. They're full of shit.  But you only realize this if you try to sleep around.  You will see them all contradict and go back on their words.  The men who struggle are men who believe their words."
          },
          {
            "score": 2,
            "body": ">People wanting to know where they \"fit\" with others so that they can progress their relations with those other people.\n\nNo, you're over-intellectualizing relationships.  \nYou have to remember that women existed before technology, books and the internet came to be.  \nWhat attracts them is very basic things, but our \"education\" actually made us dumber about relationships.   \nWomen literally are not even self-aware of what makes them attracted to men.   \nThey got confused because of media feeding them fantasies.   \nThen men who listen to women, get confused by believing their fantasies also.  \n\nThe word \"attraction\" implies polarity to begin with.  \nTo polarize someone causes you to make them feel some type of way.  \nA friend does not invoke feelings in a woman.  \nThey are interested in people who make them feel a type of way.  \nThey don't care about anything other than how you make them *feel*.  \n\nConcise it as simple as possible.  An arrogant guy is polarizing and forces them to feel some type of way.  \nArrogant indicates the guy is not only confident but he gives off the feeling he might be better than her.  \nA woman who lacks confidence in herself, will get polarized by a confident guy.  \nA woman who is already confident in herself, will not feel anything towards a guy being confident.  \nConfidence will not polarize her.  Then she wants something else to polarize her.  \n\nThe key here is *polarize* and *feelings*.  \nnothing else.  If you try to define it beyond this, then you are turning dating into something robotic and routine/scripted, and if you do that you can't polarize her.  You will come off as robotic and unnatural to her and there's too many robot men out there.  \n\nDating is easy the more you simplify it and give yourself freedom to express your natural self.  \nPropaganda in dating made dating no longer natural and turned men into robots who can't stimulate women."
          },
          {
            "score": 2,
            "body": "If you aren't polarizing anyone, then that means people are indifferent to you.   Most people are trying to find a happy medium where no one hates them.  But that means no one likes them either.  \n\nAll relationships are polarizing, and if they aren't people will get bored and leave you anyway."
          },
          {
            "score": 2,
            "body": "that sounds like a movie scene, lol."
          },
          {
            "score": 8,
            "body": "that's the funny part, the politicians, government. it's full of bullies. donald trump is the biggest bully in the world and he's president."
          }
        ]
      },
      {
        "score": 1,
        "body": "There is a difference between being confident and being obnoxious. It is very easy to be the latter when aiming for the former. Not to say it's not much harder when you're uglier, don't misunderstand me.",
        "author": "TransmissionsSigned",
        "author_hot_comments": [
          {
            "score": 1,
            "body": ">Si sabes que congelar el tiempo implica afectar el espacio verdad? Ya que detener el tiempo implica afectar el espacio + tiempo ya que estás dos van de la mano y esto está por encima de las matemáticas convencionales de Gojo.\n\nDon't try to adapt real world physics to this, it makes no sense. If infinity divides the space such that Esdeath can never touch Gojo, it doesn't matter that time is stopped, because Esdeath keeps moving through space.\n\n>Aprende sobre dimensionalidad o incluso algo de física, \n\nIronic."
          },
          {
            "score": 1,
            "body": ">So, why should men keep giving attention when they receive none?\n\nThis? But:\n\n>Interestingly enough, what men do always catches their attention. They want to know what men are up to, even if men are \"ill intentioned as a majority\"\n\nWhich is what you're doing. You care that they care, aka, attention.\n\n\"But I didn't say they are ill intentioned as a majority!\". Exhibit A:\n\n>*As long as men give them attention, men are a tool for self esteem*\n\nStill, I don't care enough about the humor in the situation to argue. Cheerio."
          },
          {
            "score": 1,
            "body": "From Yamcha to Grand Priest, depends on the Superman version."
          },
          {
            "score": 1,
            "body": "Gojo."
          },
          {
            "score": 1,
            "body": "https://preview.redd.it/mnrinpjpz9kf1.png?width=1080&format=png&auto=webp&s=95e4e9981e60fc816fe500b0054b9ad198fe4467\n\nThere."
          },
          {
            "score": 1,
            "body": "That this post is about you caring about what women do, while generalising them in a way which implies you probably don't like them very much. It's funny, is all, didn't mean to offend."
          },
          {
            "score": 1,
            "body": "Unsurprising. "
          },
          {
            "score": 1,
            "body": "I just get bored and start something else. I've never felt guilty about it. Just today I dropped Ender in Exile, and I couldn't be happier."
          },
          {
            "score": 1,
            "body": "I was 7. I had a friend who said he was smarter than me. To prove it, he read Matilda, by Roald Dahl. \n\n\nI was confident he was wrong. To prove it, I read David Copperfield, by Charles Dickens.\n\n\nIt all fell into place from then."
          },
          {
            "score": 1,
            "body": ">So how, then, can you really tell whether or not someone else is confident in themselves without being obnoxious, yourself?\n\nIt's not what you *are*, it's what you *come off as*. There are some behaviours that read as obnoxious even if that's not the intention. For example, I know a guy that knows when he's right, he's confident about it. No one likes him because it's always his priority to show how he's right and you're not. It's obnoxious.\n\n>if - for example - if someone doesn't like me then they get to say I'm \"not there\" yet.\n\nIf someone doesn't like you, you could be Henry Cavill himself, it wouldn't matter. Being confident only helps *before* you know someone in my experience. I know where you're going with this, but I don't think it applies. Most people probably don't dislike you because you're ugly. If that were the case, most ugly people would be alone and they are not. Such a social bias exists, and I can't know the extent of it, but many of the people I consider ugly live full social lives.\n\nWhen I was younger, I thought everyone hated me when they actually didn't. I was sure that people disliked me upon laying eyes on me and that I had 'something' fundamentally unlikable. Is it possible you're going through something similar?\n\n>what makes someone appealing isn't actually this notion of \"confidence\" but rather something else.\n\nYes, of course. It's not that confidence makes you appealing, it's that the lack of it makes you unappealing. For example, I'm fairly good looking, but since I had the confidence of a wet sock, when I was approached it didn't tend to last long UNLESS I was comfortable for whatever reason, which made me more confident.\n\nYou are not going to become desirable just because you're confident, but it helps to show people *you*. When people who love you tell you to be confident, they probably think you are worth showing. When people on Reddit say it, they are being parrots.\n\n>In the end it is all subjective; one thing that true confidence *shouldn't* be doing is making you think you know everything, because you really don't.\n\nTrue confidence is just not giving a crap, I think. That's why it's so hard to get or fake, because if you care about being confident, you aren't. When you care, you crave validatio and that becomes obnoxious, which is commonly lumped in with 'overconfidence'.\n\nSome people have other positive qualities that allow them to be obnoxious and still find success. They are not being rewarded for being obnoxious, but in spite of it. Their other qualities just cancel it out. Looks are a common example because you don't have to work through a person's personality to see them, unlike humor, kindness, etc; which take longer."
          }
        ]
      },
      {
        "score": 1,
        "body": "I think that goes for a lot of things, actually. For example, dancing. Everyone adores those who can break out dancing and just be themselves, living their best life...if they're attractive or famous enough. A huge trope in the late 90's and early 2000's was fat people dancing always being funny and cringe-y. Think Monica on Friends. People wont ever admit this, but they actually get offended if they think someone unattractive doesn't know their place. To the point where someone ugly to them asking them out is laughable.",
        "author": "MrFluffPants1349",
        "author_hot_comments": [
          {
            "score": 9,
            "body": "Yep, sounds like he might be some kind of shift lead, but anything disciplinary like that should be handled by a supervisor or manager. Moreover, I would contest it by asking to see the documented procedure, and if there was any evidence to show that I was properly trained on said procedure. You can't just write someone up on a whim for procedure errors, it needs to be supported by data."
          },
          {
            "score": 2,
            "body": "It definitely has a different set of challenges, and just because they're smarter doesn't mean they won't require oversight. Especially if that intelligence comes with neurodivergency. \n\nOne of my reports is very smart, in many ways that I am not, but I also realize that my leadership is still essential. Initially, I took their being smart to mean they wouldn't need as much guidance and direction. Especially since they transferred from inventory control, my expectations for accuracy, due diligence, and thoroughness were fairly high. I erroneously thought their application of knowledge would be seamless in their current role, and that assumption ended up burning me several times. \n\nCommunication, follow through, and ability to flexible and adapt to other perspectives are the areas that I needed to focus on. They really struggle with answering the question asked instead of answering the question they think the person is getting at, and it constantly gets them into trouble. They don't even realize they are doing it. They also make assumptions and state them as fact instead of verifying their claims. They have a tendency to step outside of their scope, make decisions based on their limited perception, and fail to realize they need approval from me to ensure there is alignment with the bigger picture. \n\nFortunately, we have made great progress in these areas, where previous leaders honestly gave up because they interpreted these tendencies as the smart associate just being difficult and unable to grow. I'm neurodivergent myself, so I picked up on a lot of the hurdles that others didn't even realize we're there. While it has been frustrating, the experience gained is invaluable, and I feel like I am closer to my goal of their being fulfilled in their role. \n\nSimply put, just because they are extremely intelligent doesn't mean there isn't much to learn from you. Just because they're smart doesn't mean they will automatically make the right choices. Just because they know more about a process, an application, or a piece of equipment doesn't mean they dont need your insight. If anything, they will need your support more than you probably think. It also requires you to adapt to their learning style, personality, and perspective. The respect will come when they realize you care about their growth, rather than just assuming they can handle most things without support."
          },
          {
            "score": 18,
            "body": "That is so goddamn ridiculous, dude. Be careful with this one... you may want to get a restraining order."
          },
          {
            "score": -3,
            "body": "Objectively, the way I see it is that you broke up under the pretense that she couldn't handle a relationship with everything else. Yet, she has the bandwidth to get involved with her ex? Might sound weird, but I would understand if it was a date with someone new, or even a one night stand - with some reservation, of course. I would consider it completely over at that point. It would make me wonder if there was more to the break up on her side than she is alluding to, and if the ex had something to do with it. Either way, too messy to salvage. Time to move on."
          },
          {
            "score": 3,
            "body": "Absolutely, one of my reports really struggles with this, and his solution is to always ask for OT. However, when I dig into it, it's obvious he is not delegating like he should, and not pushing the associates to be self-sufficient - he just jumps in and fixes things for them whenever they call him on the radio. As a result, his business comes from constantly responding to those calls, and not being consistent with holding them accountable when the situation calls for it. \n\n\nWe have made a lot of progress, but it requires constant effort to avoid the same pitfalls. Its easier to just operate in survival mode, instead of managing your time effectively and using what resources you have. Deep down, there is some avoidance, because often times the work that needs to be done in that regard is difficult and tedious. It's easy to be avoidant when you can just look busy and get by for the most part. Eventually, it will catch up to you, though. You're just making things more difficult and unsustainable in the long run.\n\nI always say, \"everyone wants to be the fire fighter, but wouldnt you rather prevent the fires from occurring in the first place?\""
          },
          {
            "score": 2,
            "body": "Yep, definitely start having those requests documented so he doesn't take you down with him. What he is doing right now is incredibly selfish, no matter how much he will make himself out to be a martyr in the end, so I doubt he will own it once it comes down to it."
          },
          {
            "score": 5,
            "body": "Because of the just-world bias. It's easier to tell yourself what they're missing is confidence when the truth is that they're just fucked. When in reality, confidence is the product of someone being secure in themselves and their qualities/skills. How could someone possibly be confident if the majority of society is telling them they're just doing it wrong. Like, yeah, your face isnt doing you any favors, but maybe stop telling people you like anime. Go to the gym. Change everything about yourself, and then you can be confident. And if you dont see any improvements, well, just be more confident. But dont be annoying, but dont be invisible, even though most people expect you to and are bothered when youre not."
          },
          {
            "score": 1,
            "body": "First of all, 75K is not even remotely braggable. Like, congrats, dude, you *might* be able to live somewhat comfortable, if you live within your means. He is probably going to accrue a bunch of CC debt and then get laid off."
          },
          {
            "score": 0,
            "body": "Yeah, it does sound pretty fake, but i live for that 5% chance where it might not be. The *therapist* loaning that kind of money, or even if she is just her friend, does not make sense at all. Weirder things have happened, though."
          },
          {
            "score": 2,
            "body": "Representing yourself is rarely successful in any context."
          }
        ]
      }
    ]
  },
  {
    "title": "Gender inequality at the societal level is a balancing variable for the fact that women have inherent interpersonal value and men do not.",
    "content": "Pretty self explanatory, women have the specific social and societal place that they do in any human culture (this place varies) because of the imbalance of inherent value attributed at a genetic level and how the individuals of that culture deal with that imbalance. Gender wars are pretty dumb when you get right down to it. Any argument from either side is basically just individuals responding to assumed societal and interpersonal value, which, regardless of gender doesn’t care about who you are as an individual. women have inherent value. Any complaint coming from the feminist community basically boils down to: “I have inherent value as a female, and no inherent value as an individual and I’m upset about the social and societal consequences of this fact playing out in this specific way etc.”\nAny complaint coming from the male community basically boils down to “no one gives a shit because I have no interpersonal or societal value as an individual and I’m upset about the social and societal consequences of this fact playing out in this specific way etc. ”\n\nBoth sides should really just stfu and practice a little empathy, as both sides really just want to be assured of their value as an individual, and any hint of justification for the other side reads as a direct confrontation of their sense of value and self. Basically we ALL have it tough, and empathy is the answer, not the negative feedback loops we find on Reddit. Thanks for tuning in. ",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1mv133h/gender_inequality_at_the_societal_level_is_a/",
    "score": 0,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1mv133h",
    "bertscore_f1": 0.5014352202415466,
    "bertscore_precision": 0.4932206869125366,
    "bertscore_recall": 0.5099280476570129,
    "top_level_comments": [
      {
        "score": 12,
        "body": "Why do you believe \"women have inherent interpersonal value and men do not.\"\n\nYour entire post hinges on this, and you didn't explain it.",
        "author": "stevejuliet",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "Who the fuck thinks Trump \"accidentally\" became president?\n\nI mean, aside from Trump and his first term team, who were fucking *shocked* to win and had absolutely no plan in place and had to scramble to write a victory speech and hire staff!"
          },
          {
            "score": 6,
            "body": "This trivialize every other method. I don't even need to stop whatever else I'm doing. If I'm low on units, I just pop a donut and scan a few fauna as I play."
          },
          {
            "score": 9,
            "body": "Wow...this is trash.\n\nAnd not necessarily because it's AI. It's just trash."
          },
          {
            "score": 1,
            "body": ">MSNBC\n\nI gave you NBC, not MSNBC. There is a significant difference.\n\nEither way, though, the article is purely factual.\n\n>the article itself doesn't say much.\n\nThe article points out how multiple authors of specific chapters of Project 2025 are now leading the exact sectors of the government they criticized. They were selected by Trump.\n\n>You immediately take this condescending approach\n\nYes, because you are making absurdly false claims while claiming you are being logical. Project 2025 wasn't \"a lie.\" Its authors are currently *running significant areas of the government*. That's not debatable. That's a fact.  You aren't being logical. You are simply incorrect."
          },
          {
            "score": 1,
            "body": "Fucking leopards, my man."
          },
          {
            "score": 5,
            "body": "In a strictly pedantic scenario, sure, it's *grammatically* sound. However, it clearly isn't a good faith interpretation of those abilities. You're looking for a loophole, but what you are attempting to accomplish isn't in the spirit of *either* of those classes."
          },
          {
            "score": 1,
            "body": ">Project 2025 was a lie. didn't find any proof it it.\n\n[Holy shit.](https://www.nbcnews.com/politics/trump-administration/key-project-2025-authors-now-staffing-trump-administration-rcna195107) For someone who claims to be \"logical,\" you have no clue what's going on."
          },
          {
            "score": 11,
            "body": "The Establishment Clause of the First Amendment forbids Congress from passing laws that respect an establishment of religion."
          },
          {
            "score": 2,
            "body": "It's not the public schools doing this. It was the Texas legislators. Don't blame the teachers."
          },
          {
            "score": 1,
            "body": "Okay. I'll rephrase it:\n\nI'm going to need you to explain how the \"mass die off of shrimp\" **could be** attributed to leftism."
          }
        ]
      },
      {
        "score": 6,
        "body": "I have no idea what \"inherent interpersonal value\" means. And I don't really care. I just want to be treated like a person. \n\n And no I'm not going to accept \"gender inequality at the societal level\".",
        "author": "Various_Succotash_79",
        "author_hot_comments": []
      },
      {
        "score": 4,
        "body": "“empathy is the answer” and “we all have it tough”, but men do not have interpersonal value and this is genetic. Make it make sense.",
        "author": "UnscentedSoundtrack",
        "author_hot_comments": [
          {
            "score": 2,
            "body": "Trees do in fact compete for resources, the most obvious one being sunlight."
          },
          {
            "score": 1,
            "body": "How are they a scam?"
          },
          {
            "score": 1,
            "body": "Is gay marriage not a scam?"
          },
          {
            "score": 1,
            "body": "Believe it or not, some people love and enjoy their kids."
          },
          {
            "score": 0,
            "body": "Are you admitting you’re a scammer?\n\nI mean, you are your parents’ kid. Would you say your value is a zero return to your parents’ investment?"
          },
          {
            "score": 1,
            "body": "Jesus, half of this thread can be tagged with “I’m 14 and this is deep”"
          },
          {
            "score": 1,
            "body": "I don’t know about you, but I make money when I work."
          },
          {
            "score": 1,
            "body": "Yes, you own it."
          },
          {
            "score": 1,
            "body": "Even then, it takes around 6 years or so to fully complete the forfeiture process due to unpaid taxes, at least around my neck of the woods, and that is if you do fuck all."
          },
          {
            "score": 1,
            "body": "I agree that permissiveness is a horrible way to parent, but I disagree with the notion that the only two practical options are spanking or nothing. Parents have used other forms of discipline other than spanking for a really long time (I’d say since humans are humans), and they continue to do it now."
          }
        ]
      },
      {
        "score": 2,
        "body": "I think the problem is more women will say \"women have as much value as men\" when faced with inequity. Men face what they perceive as an inequity and will say \"women have less value\".",
        "author": "Nidus-Zealot",
        "author_hot_comments": [
          {
            "score": 10,
            "body": "I don't because it's not on the female model"
          },
          {
            "score": 1,
            "body": "Same but I want the pose on the grill."
          },
          {
            "score": 2,
            "body": "I think the problem is more women will say \"women have as much value as men\" when faced with inequity. Men face what they perceive as an inequity and will say \"women have less value\"."
          },
          {
            "score": 1,
            "body": "Yeah that's what I'm getting at.\nMen and women also accuse other men and women based on this so OP isn't correct on his reasoning being the insecurity of the scolder, but instead a condemnation of another based on the viewpoint of the scolder."
          },
          {
            "score": 3,
            "body": "That's just nidus phryke with less drip"
          },
          {
            "score": 1,
            "body": "That goes either way, women also get the same rhetoric.\nI disagree with the denying their own undesirability and whatnot. What they want to say here is that they do not find the behaviors acceptable for what they consider a \"real man/woman\". It's similar to the post - it's assuming that you would know if any of those things are true.\nThere's an old couple at the pool I go to and the old man kinda rushes in past his wife to get in the pool instead of helping her and holding the door (she's in a walker) \nMy mom will say \"he's not a real man\" because the behavior is not congruent with the behavior she believes makes a good man. My dad always does things like that for her, so it's certainly not a desirability or avoiding accountability thing. \nIt's about the behavior. That's pretty much it."
          },
          {
            "score": 1,
            "body": "What did your mom never tell you a lie to keep you safe? She dipped out for a hot minute in one quest because trying to figure out how to deal with all of that took precedence. Not like a great move but not done maliciously. The whole new war stuff was literally brainwashing and psychological shit being done by Ballas. Lotus has her own demons and isn't infallible but she's been fighting the void on our behalf for a long while now. She's literally on that ledge in the Sanctum at this point in the story fending it off to facilitate the 1999 events."
          },
          {
            "score": 1,
            "body": "Nah, she already had her \"villian\" arc. No reason to do it again it would be redundant and pretty character breaking. She's like your mom in the same way that you grow up and realize she is also a whole person aside from \"mom\". Something like the \"maiden-mother-matron\" dynamic being explored. Anyway. Not evil."
          },
          {
            "score": 1,
            "body": "It is impossible to resist being cringe no matter how old you are. Just wait another 10 years and we will see another evolution."
          },
          {
            "score": 1,
            "body": "Make it do toxin damage (iykyk)"
          }
        ]
      },
      {
        "score": 1,
        "body": "What you mean is that men's interpersonal value is lesser because they are much less empathetic and pro-social, or...?",
        "author": "MealAggressive3857",
        "author_hot_comments": [
          {
            "score": 8,
            "body": "Bingo!"
          },
          {
            "score": 5,
            "body": "You were a victim of a crime - likely not his first one. What you do is contact the police and insist they follow up and contact unit that deals with these kinds of threats - sextortion made people commit suicide so after death of teenage boy they apparently founded a focused unit.\nDon't be ashamed. These people prey on desperation. They are vile. You made a mistake, now you know better. Change passwords, contact Paypal and have law enforcement do their job. Do not engage with the creep."
          },
          {
            "score": 3,
            "body": "There is a clear bias at play. Request the body cam. Were your injuries documented at intake? Preferably by someone like a forensic nurse? If not, you need to have them documented ASAP.\nAnd leave. Abusers in the armed forces globally have much higher rates of killing their victims, unfortunately in my country the police fraternize with them as colleagues instead of treating them for who they are at the moment."
          },
          {
            "score": 1,
            "body": "The stitches are an unavoidable part of autopsy, but they should have been hidden better. It must have been difficult to see."
          },
          {
            "score": 1,
            "body": "What you mean is that men's interpersonal value is lesser because they are much less empathetic and pro-social, or...?"
          },
          {
            "score": 2,
            "body": "You were so, so brave ❤️ I'm so happy you fought - for justice for yourself but very likely other potential victims. Paper trail is important."
          },
          {
            "score": 1,
            "body": "Bingo.\nEven if he follows through with his threats, it's not your fault OP. This kind of manipulation is abhorrent. \nI've dealt with it - called the authorities. If he wants to hang himself in my garage he better pay for renting the space and be mindful of the car 😂\n\nThe type of people who make threats like these very rarely go through with them ( and are the kind of people that wouldn't be particularly missed anyway). Their actions are their responsibility alone. Someone truly suffering would never put that kind of burden on anyone - and I should know as a barely-survivor. The fact that someone uses this kind of threat means they don't care about that person beyond what they can do for them and only around that time period.\nIn my case, he was the one who majorly contributed to my pitiful state that resulted in me almost succeeding in logging out (and wrecking my body and brain), he was the one who knew I had plans and that I obtained the means, he knew the entire plan and did nothing to intervene nor did he offer help before it got to that point  - he didn't care (despite us being together then,me putting my life on hold to take care of him during the manic episode and being the major breadwinner and housemaid and helping his parents with their business), literally responding \"ok\" when I told him that I don't know if I can go on....and now, two years after I left he expects me run out in the middle of the night because he's manic again and screaming in front of the building plus writing said treats from new numbers? Goofy.\n\nThe right response is to inform the cops, if you know the family - inform them too ( just to have a clear conscience), and block. Don't engage or you'll train him that it's effective. Don't taunt ( tempting, but it's better to be above this), don't engage. Give information to authorities and their family and ignore completely."
          },
          {
            "score": 1,
            "body": "Lawyer up. Document everything. Don't leave the charge pending - if she doesn't straighten up her lies the charge will make it very difficult for you to retain any relationship with the kiddo, not to mention it's just a really bad look. Talk to her about it - preferably through messages or record it somehow if you are a one party consent state. Make victims are rare and assault charge will make you much less likely to be listened to as it's a common tactic.\nUnless she's willing to genuinely work on it - therapy and all the jazz - this will only escalate. Is this the kind of life you want?"
          },
          {
            "score": 1,
            "body": "You know your mom best. If I was in that situation, I would have told her - but don't come at her with an accusatory tone. \nTell her you don't want to mourn her, tell her stories of women killed, mention statistics, quote and buy her Lundy Bancroft's \"Why does he do that\" (or have her read it online). Tell her you understand that she's drawn to him - just not why (You can ask her this - make her say it out loud. Sometimes it takes speaking about something out loud to realize it).Tell her how much you are afraid.  Tell her how you genuinely feel, tell her your fears, tell her how helpless you feel watching the tragedy that kills so many wonderful women play out in front of your very eyes, unable to stop it. Don't be cruel but don't let her minimize the risk either. \n\nUltimatums rarely if ever work, honesty is - in my opinion the best policy. How you frame it depends on your and your mom's characters, of course.If she tries to be angry at you, only then I would go for the \"if you don't care that you die you must not you realize the wound you would leave in my heart and life when he finally kills you, I don't want to live in the world where I let it happen, where I let my mom be slaughtered by *insert accurate description*. Do you remember (recall what he did, how you consoled her, but make it about how it affects you instead (reverse psychology -  relying on her mother's protective instinct)? How I'm supposed to feel when you are choosing.. him over yourself, over your children, what can I do to change your mind, I'm waiting for the cops to visit every time you see him, every call I fear they are calling to tell me he killed you\" - kind of talk. \n\nDon't make it about her being selfish, or weak, or dishonest - make it about how much she means to you and how her actions affect you and about her deserving better.\nWhen speaking about him, emphasize the physical danger he poses but don't portray him as some sort of powerful, uncontrollable figure - ridicule him instead. Emphasize everything your mom complained about, point at his goofy face, stinky breath, beer gut, his haircut, his lack of hygiene or lazy eye - contempt is the opposite of desire. Cultivate contempt for him in her eyes- the more she sees him for who he is - weak, pathetic, gross loser instead of someone strong ,capable,  someone in power over her, the more likely she is to withdraw from him \n\nYou can't control her reaction and largely her attitude will decide whether or not she genuinely takes it to heart - it's imperative you have this conversation at the right time when she's the most receptive.\nUltimately - it's beyond your power to change. Best of luck - I know it's tough. Your mom is lucky to have you ❤️"
          },
          {
            "score": 1,
            "body": "It genuinely sounds like the judge mis-read the opinion. You need to fight it - obviously, alas, I'm in Europe and our legal systems are vastly different - thankfully, other commenter made better suggestions. Do you have a lawyer retained?"
          }
        ]
      },
      {
        "score": 0,
        "body": "Men have inherent interpersonal value. It's called \"income\", or maybe \"wealth\" if you're very fancy. \n\nThe phrases you are looking for are \"Commodification of Women\" and \"Disposability of Men\". These are both aspects of what we used to call \"Patriarchy\" before MRAs drove it into the ground. \n\nI think that you shouldn't expect more empathy, than you're willing to give. Feminists don't think of Feminism as a \"Gender War\", that's a framing you put on the situation your own self.",
        "author": "letaluss",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "They also told us that Trump would facilitate a peaceful transfer of power."
          },
          {
            "score": 1,
            "body": "> Atheists often try to evade god by saying we exist in a multiverse. \n\nNever met this Atheist before. They sound cool.\n\nThe position you've outlined is more like 'agnosticism' than any mainstream religion.\n\nBut even taking you at your word, you are a long-long way from demonstrating that because there is a God, it is specifically the *Christian* God, and that we have to follow his moral teachings."
          },
          {
            "score": 1,
            "body": "> If you take credit for the crime rate going down, you have to take the blame when it goes up.\n\n- Major Daniels, *The Wire*.\n\nSo when are they releasing the Epstein files? Can't wait to hear about all of the criminal Democrats inside of that. :)"
          },
          {
            "score": 1,
            "body": "Milquetoast*\n\nI think the frustration is mostly directed at our government institutions which pay defense contractors big-ass-bucks, instead of investing in like, infrastructure or healthcare or services that US citizens would directly benefit from."
          },
          {
            "score": 1,
            "body": ">  Putting 100% of the blame on schools because parents don't want to interact with their children to help them grow seems a bit unfair and was never really something they were expected to do.\n\nNo, I also blame parents and activists that ban literature and academic materials because they're afraid of critical thought. \n\n> and to excel in entrepreneurship \n\nI didn't say 'excel in entrepreneurship', actually. A fuller, more aware and conscious adult is not necessarily an excellent entrepreneur, because not everyone is going to be an excellent entrepreneur.\n\n> you are going to have a bad time. \n\nI mean, I agree. The entire array of American neoliberalism would coalesce to stop any education system that might disrupt the balance of labor and capital. \n\nBut just because something is difficult, doesn't mean it's not worth doing. \n\n> Putting 100% of the blame on schools because parents don't want to interact with their children to help them grow seems a bit unfair and was never really something they were expected to do.\n\nIt's not entirely their parents fault. Your parents were *also* given terrible Mathematics education, and so aren't as well equipped to help their children with difficult mathematical concepts as they are with say, Literature or music appreciation."
          },
          {
            "score": 1,
            "body": "> Eh, the purpose of public schools are mainly to get students to read, write, do some math and try to instill some sense of national unity. There's some accountability that needs to be put on parents shoulders if they believe they should guide their kids a certain way.\n\nYes. Reading, writing, and nationalist indoctrination are necessary skills for cheap, productive workers.\n\n> Also to be fair, we have come a long way from having most of the population be trained to work in textile mills at the start of the 20th century, so I think there has been some success.\n\nI don't think we've come a long way. The education requirements for a textile worker are much lower than most modern service industry jobs. That's why they were largely automated, after all."
          },
          {
            "score": 1,
            "body": "> Like congratulations Rebecca, you found out that if we had a perfect society, many bad things wouldn't happen. I'd love to live in socialist utopia and I think that if that were a possibility, we would have done it like yesterday\n\nRepublicans are always like \"yeah it would be nice if we tried to improve society, but a perfect society is impossible so why bother?\"\n\nReally frustrating, tbh."
          },
          {
            "score": 1,
            "body": "A fun fact for you that I learned six minutes ago: \"Milquetoast\" is a reference to a cartoon character [\"Caspar Milquetoast\"](https://en.wikipedia.org/wiki/Caspar_Milquetoast).\n\n>  but I guess that could be said to basically any part of the government as well.\n\nIDK. I think that some government investments aren't totally pointless. Like social programs, education, SNAP/EBT, stuff like that."
          },
          {
            "score": 1,
            "body": "Atheism isn't a cosmological belief system, it's a religious one. \n\n> There is evidence,but you're not going to believe anyway. And would call it mental gymnastics\n\nIf your belief system was logically derived, shouldn't it be able to withstand logical scrutiny?"
          },
          {
            "score": 1,
            "body": "So if you concede that there is no evidence for your faith-system, don't you necessarily concede that being an Atheist is a logical position?"
          }
        ]
      }
    ]
  },
  {
    "title": "I think ID verification to view online porn may have unintended benefits,",
    "content": "I don't think requiring people to upload their ID to view porn online will result in any of the benefits it's intended to have. I don't think I can talk about why because of rule 12, but I do actually think it might have some benefits.\n\nI know a bunch of Leftists are going to come out of the woodwork to say lie and I'm crazy and I'm the one looking at fucked up porn, but even the most mainstream porn sites (specifically when you don't allow them to use cookies so they can't tailor the results to you and you see what everybody who's never been their sees) have got fuckin' disgusting over the last several years and I don't think it's a natural, market dictated thing. I don't believe for a second that everybody just suddenly decided that what excites them is the same kind of thing that excited the psychos in the pawn shop from \"Pulp Fiction\", men having their assholes licked, black supremacy porn, and point of view videos of women telling the viewer how much of a pathetic loser they are.\n\nI think there are some people who decided to flood porn sites with a bunch of bots to try to psychosexually fuck a bunch of people up. Just like a lot of other sites that make money on advertising, they're financially incentivized to not get rid of bots because bots make it look like there are more people using the site than there really are and they can get companies to pay more for ads.\n\nID verification is going to get rid of the bots. You get rid of the bots, you get rid of the psyop.",
    "url": "https://www.reddit.com/r/TrueUnpopularOpinion/comments/1muysp8/i_think_id_verification_to_view_online_porn_may/",
    "score": 0,
    "flair": "Sex / Gender / Dating",
    "nsfw": false,
    "id": "1muysp8",
    "bertscore_f1": 0.5007793307304382,
    "bertscore_precision": 0.49077528715133667,
    "bertscore_recall": 0.5111997723579407,
    "top_level_comments": [
      {
        "score": 5,
        "body": "You should read history of any totalitarian society. All the censorship started either as \"kid protection\" or \"bad bad country nearby protection\"",
        "author": "Lindensan",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "When I tried dota I got banned for playing not good enough. Now that's what I call new player friendly."
          },
          {
            "score": 1,
            "body": "Genshin is for genocide I guess"
          },
          {
            "score": 39,
            "body": "Wow, that's why we can't have good things I guess. I've noticed that animations/music/climate is perfect, but never suspected it was the result of two years of work. It really deserves to be the anime of the season."
          },
          {
            "score": 5,
            "body": "You should read history of any totalitarian society. All the censorship started either as \"kid protection\" or \"bad bad country nearby protection\""
          },
          {
            "score": 2,
            "body": "I have crush at work, maybe "
          },
          {
            "score": 3,
            "body": "Millennials are more educated, because child censorship didn't exist when they were young and they had a chance to develop critical thinking. Imagine what would happen if you stick in kids YouTube world till you are 18 and then get rights to vote. Well, you don't need to imagine."
          },
          {
            "score": 2,
            "body": "I think anti-ai is something similar to artists  trying to cancel photography - good luck with that."
          },
          {
            "score": 1,
            "body": "I thought it is a spoiler in the name and yoshiki will kill him till the end of summer.(I don't know if it is true because I'm anime only, so that's not a spoiler)"
          },
          {
            "score": 8,
            "body": "That shouldn't be legal. At least in EU."
          },
          {
            "score": 1,
            "body": "I dropped it months ago and I'm still depressed about that."
          }
        ]
      },
      {
        "score": 3,
        "body": "Marquis de Sade died 211 years ago, well before online pornography was even conceived. The diversity of sexual tastes you are witnessing is perfectly natural. \n\nYou're just projecting sexual hangups.",
        "author": "letaluss",
        "author_hot_comments": [
          {
            "score": 1,
            "body": "They also told us that Trump would facilitate a peaceful transfer of power."
          },
          {
            "score": 1,
            "body": "> Atheists often try to evade god by saying we exist in a multiverse. \n\nNever met this Atheist before. They sound cool.\n\nThe position you've outlined is more like 'agnosticism' than any mainstream religion.\n\nBut even taking you at your word, you are a long-long way from demonstrating that because there is a God, it is specifically the *Christian* God, and that we have to follow his moral teachings."
          },
          {
            "score": 1,
            "body": "> If you take credit for the crime rate going down, you have to take the blame when it goes up.\n\n- Major Daniels, *The Wire*.\n\nSo when are they releasing the Epstein files? Can't wait to hear about all of the criminal Democrats inside of that. :)"
          },
          {
            "score": 1,
            "body": "Milquetoast*\n\nI think the frustration is mostly directed at our government institutions which pay defense contractors big-ass-bucks, instead of investing in like, infrastructure or healthcare or services that US citizens would directly benefit from."
          },
          {
            "score": 1,
            "body": ">  Putting 100% of the blame on schools because parents don't want to interact with their children to help them grow seems a bit unfair and was never really something they were expected to do.\n\nNo, I also blame parents and activists that ban literature and academic materials because they're afraid of critical thought. \n\n> and to excel in entrepreneurship \n\nI didn't say 'excel in entrepreneurship', actually. A fuller, more aware and conscious adult is not necessarily an excellent entrepreneur, because not everyone is going to be an excellent entrepreneur.\n\n> you are going to have a bad time. \n\nI mean, I agree. The entire array of American neoliberalism would coalesce to stop any education system that might disrupt the balance of labor and capital. \n\nBut just because something is difficult, doesn't mean it's not worth doing. \n\n> Putting 100% of the blame on schools because parents don't want to interact with their children to help them grow seems a bit unfair and was never really something they were expected to do.\n\nIt's not entirely their parents fault. Your parents were *also* given terrible Mathematics education, and so aren't as well equipped to help their children with difficult mathematical concepts as they are with say, Literature or music appreciation."
          },
          {
            "score": 1,
            "body": "> Eh, the purpose of public schools are mainly to get students to read, write, do some math and try to instill some sense of national unity. There's some accountability that needs to be put on parents shoulders if they believe they should guide their kids a certain way.\n\nYes. Reading, writing, and nationalist indoctrination are necessary skills for cheap, productive workers.\n\n> Also to be fair, we have come a long way from having most of the population be trained to work in textile mills at the start of the 20th century, so I think there has been some success.\n\nI don't think we've come a long way. The education requirements for a textile worker are much lower than most modern service industry jobs. That's why they were largely automated, after all."
          },
          {
            "score": 1,
            "body": "> Like congratulations Rebecca, you found out that if we had a perfect society, many bad things wouldn't happen. I'd love to live in socialist utopia and I think that if that were a possibility, we would have done it like yesterday\n\nRepublicans are always like \"yeah it would be nice if we tried to improve society, but a perfect society is impossible so why bother?\"\n\nReally frustrating, tbh."
          },
          {
            "score": 1,
            "body": "A fun fact for you that I learned six minutes ago: \"Milquetoast\" is a reference to a cartoon character [\"Caspar Milquetoast\"](https://en.wikipedia.org/wiki/Caspar_Milquetoast).\n\n>  but I guess that could be said to basically any part of the government as well.\n\nIDK. I think that some government investments aren't totally pointless. Like social programs, education, SNAP/EBT, stuff like that."
          },
          {
            "score": 1,
            "body": "Atheism isn't a cosmological belief system, it's a religious one. \n\n> There is evidence,but you're not going to believe anyway. And would call it mental gymnastics\n\nIf your belief system was logically derived, shouldn't it be able to withstand logical scrutiny?"
          },
          {
            "score": 1,
            "body": "So if you concede that there is no evidence for your faith-system, don't you necessarily concede that being an Atheist is a logical position?"
          }
        ]
      },
      {
        "score": 2,
        "body": "Your children's viewing habits aren't my responsibility.",
        "author": "Soft_Accountant_7062",
        "author_hot_comments": [
          {
            "score": 8,
            "body": "Hope."
          },
          {
            "score": 2,
            "body": "Because they witheld medicine from refugees."
          },
          {
            "score": 6,
            "body": "It's also kinda justified by being in another dimension. Who knows how their physics work."
          },
          {
            "score": 1,
            "body": "Only a third of US citizens voted for him."
          },
          {
            "score": 2,
            "body": "Don't you?"
          },
          {
            "score": 1,
            "body": "What's alt left?"
          },
          {
            "score": 1,
            "body": "How do you explain him posing for a photo op during an active shooter situation. I ean, nobody's that stupid."
          },
          {
            "score": 1,
            "body": "That just means it's more expensive."
          },
          {
            "score": 1,
            "body": "It's not like nobody has ever sucessfully hired a hitman."
          },
          {
            "score": 1,
            "body": ">Are you someone who organizes fake shootings for a living? \n\n Nope, so we both have an equal chance of being right.\n\n>I mean, geez, do you think that Trump just has two incredibly trustworthy people on his contacts list, one who will murder someone on his behalf and one who will handle the aftermath, such that neither will say anything?\n\nIgnoring his cult of personality, plenty of people would do that if you pay enough."
          }
        ]
      }
    ]
  }
]